[
{"website": "Ebay-Product", "title": "eBay Integrates Video into the eBay Motors App", "author": ["Geetanjali Gupta", "Gilbert Bouzeid"], "link": "https://tech.ebayinc.com/product/ebay-integrates-video-into-the-ebay-motors-app/", "abstract": "The eBay Video Platform will allow sellers to add in videos of the cars they are selling on the eBay Motors App. You only get one shot at a first impression – being able to show off your listing in an engaging video can improve buyer confidence. Today, eBay announced a new video platform called REEL, which will integrate videos into the eBay Motors App . The feature allows sellers to upload one or more videos — in addition to adding photos of the car they are listing — which improves the shopping experience. Through video, sellers will have an easier time capturing the condition and usage of the car. Building a video platform that can scale across eBay’s 1.5 billion listings will provide the following: ● High throughput with low latency for both upload and download services. ● Resilient video storage at a very low storage cost. This will require transcoding the original video into smaller but perceptually good quality videos. ● Durable and reliable storage. Any loss of data or missing chunks for a big video file can spoil the experience. ● Appropriate Service Level Agreement (SLAs) for ecommerce specific use cases of short-duration (~1 minute) videos. ● Smooth playback across multiple devices and unreliable networks. ● Efficient monitoring and visualization for a system’s state and performance. ● Visualization for business metrics. ● Simplicity and maintainability. Building on a standard stack with existing tools for deployments and configurations makes it easier for development teams and operations to monitor and evolve. REEL’s architecture is comprised of the following in order of user/system interaction: ● Video Upload pipeline ​ for ingesting large video files into the system using REEL’s resumable APIs. ● Video Processing pipeline ​ for producing smaller sized versions of the source video with similar perceived quality. ● Video Delivery pipeline ​ to enable fast streaming on players running on heterogeneous devices across the world. To start the process of uploading a video, the seller signs into the eBay Motors App and starts to create an item listing for sale. Then, they upload the video stored on their local device to the app. The app will internally use REEL APIs to upload the videos to our platform. Once the whole video is received on the server end, it is broken into smaller chunks and stored into our backend storage. This triggers an async processing pipeline, where the uploaded video is further transcoded into a smaller resolution but high perceptual quality. Transcoded bytes are statically stored and retrieved during the video’s playback using ​ DASH protocol. REEL relies on multiple levels of caching for faster delivery. HTTP servers are public-facing services that are responsible for receiving ​video uploads through resumable APIs​. If the video fails to upload due to network fault, resumable protocol lets sellers resume an incomplete upload at a future time, a feature that can be useful for large files. This can save sellers extra bandwidth and time to re-upload larger files from scratch again. Service application is an orchestrator between storage and metadata services, and serves as a video “upload complete” event producer for the async transcoding of video. We currently use Kafka​ as our message bus, which carries Video IDs for videos once they are persisted in the backend. Upload APIs require ​OAuth​tokens for ​access ​and are not public yet. They are only available for consumption by eBay applications. The REEL API currently accepts seller-provided metadata, like tags and a short description, along with a link to previously uploaded video thumbnail images. Current upload SLAs are aligned with search indexing. Uploaded bytes are stored in Binary Large Object (​BLOB) Storage​ which was built in-house to run on low cost commodity hardware and provide random reads at very low latencies, with an extremely high durability (~10 -​ 24​ probability for losing an object). It is a generic object store and is used for use cases other than images and videos as well. The key drivers for choosing it were​resilience ​and high performance. We chunk the uploaded video and store the chunked bytes as individual objects in storage with corresponding ​metadata​ in a database ​store​. Metadata includes a video’s original dimensions, size, bitrate, durations and sorts, user-provided details and peripheral things like storage object IDs. This enables metadata to be independently retrieved by eBay’s internal applications or be archived for analytics purposes. Currently, we use a homegrown, ​fault tolerant, geo-distributed datastore​. All operations on this datastore are fronted by an Entity service layer. Before reaching backend servers, upload requests are proxied through eBay’s ​Point of Presence​(PoPs). We leverage PoPs for eBay’s own ​UFES ​ (Unified Front End Services) deployments as software edge proxies between a user and our origin. This proxy connects clients to eBay’s network, bringing a customer’s request on eBay’s internet backbone with increased bandwidth and primed connections, resulting in lower latencies. It also helps with SSL terminations and other TCP tunings to achieve maximum performance. Video files are big, and they can require a lot of space for storage and bandwidth to download or stream. Files need to be compressed while maintaining a high quality and keeping the size as small as possible. Transcoding is the process to compress the original source file. We can achieve different levels of compression by altering FPS, video dimension, aspect ratio and audio/video bitrates. ​Videos are transcoded​ ​with appropriate codec to compress the original uploaded file for best perceived quality. ​Reducing the size of individual video files​significantly lowers costs of distribution​. ​The transcoding compute engine​ consumes a previous referred event (containing video ID) from Kafka, pushed by the upload pipeline once the upload is complete and starts the transcoding​ ​pipeline. Transcoding is designed around DASH protocol. The Adaptive Bitrate Streams requires a video to be divided into chunks, ideally between 1-10 seconds, and the client device can pick the chunk which best fits the device environment. This is important if the network degrades, for instance. Enabling ABR requires an encoder, which encodes a single video source into multiple bitrate adaptations as required per output resolution. Our individual target chunks are three seconds long. Each chunk is stored as an individual object in our backend storage and can be referenced as a separate entity in the metadata store. Video transcoding is a highly computationally intensive task and so we use SKUs with many CPU cores to perform transcoding. REEL has a workflow to orchestrate video processing work, storage and metadata persistence — this way, it can parallelize the expensive workload of video transcoding. This workflow is managed in a ​Kubernetes cluster​. With the myriad devices and camera settings, we standardized on our acceptable inputs and outputs for our initial use cases. The table below provides a summary: Typically, a player on a device would be playing a video associated with an item. A video is divided and stored as logical chunks as we saw in the video processing pipeline. When the backend HTTP server receives a request for a video, it fetches all the metadata required for serving the requested portion of the video. Since storage IDs are part of metadata, the server can fetch the required video files from storage and statically serve them. For delivery we make use of ​ Adaptive Bitrate Streaming ​ (ABR). ABR is designed to deliver video and audio streams efficiently over large distributed HTTP networks. REEL delivers playbacks using ​ Dynamic Adaptive Streaming over HTTP ​(DASH) streams and supports MPEG-DASH​ and ​ HTTP Live Streaming ​ with ​fMP4​ segments. Below is a brief overview on how ABR and DASH work. The client streaming videos has a pretty good idea around resources — such as bandwidth, CPU and screen size — available on the device and what the device is capable of. Clients supporting DASH can use this information to control what best resolution or bitrate it can currently support for a smooth playback with minimal stalls or re-buffering. It can switch between various bitrates on a per segment basis. As the above diagram explains, based on changing network bandwidth conditions on the device’s end, it can request a bigger or smaller resolution segment for the next fetch. All the critical information needed to switch between different encodings is stored in an ​ Media Presentation Description​ (MPD) file or ​HLS manifest files ​. To move videos closer to the user, REEL leverages two layers of caching. It tremendously helps with customer experience by bringing down the latencies from a few seconds to a few milliseconds by reducing repeated requests to origin. Manifest files (MPD/HLS) and the video segments requested are cached on their way back to the user. Third-party ​ Content Delivery Networks (CDNs)​ serve as the first layer closest to the user. At the CDN layer, we have enabled Tiered Distribution, which sends the cache misses from edge servers to smaller sets of larger-capacity, second-tier servers. This greatly increases cache hit percentage on CDN. eBay has several ​PoPs across the globe for edge computing. REEL leverages some of these PoPs to serve as a second layer of caching and the PoPs host Apache Traffic Server ​ (ATS). We provide a large amount of dedicated storage to ATS to reduce chances of cache eviction before object TTLs. This helps with the long tail cache misses from the CDNs. We leverage Unified Front End Services (UFES) deployments as software edge proxies between CDN and our origin caches as well. As you can see, there are lots of moving pieces. A robust logging and monitoring system is required for the visibility across the systems. We use eBay’s standard observability platform called Unified Monitoring Platform (UMP), which enables ​logging, monitoring and graphing capabilities​. Since we are chunking/segmenting a video at several places and there are multiple components involved, distributed tracing ​​ is necessary for tracing a request end-to-end. UMP provides ​ Prometheus ​ support for​ metrics and alerting​. Currently, we push metrics on latencies, counts and failures on each component along with system and custom metrics per component. This helps achieve the visibility required to understand the current utilization of the system and catch the issues timely. A sample dashboard for some of our video upload metrics is below: In this blog, we went deeper into the architecture of the video platform by detailing how all of the components in the platform are loosely coupled and perform a specific business capability. With our low latency storage, big compute engines, adaptive bitrate streaming and caching, we can lower our SLAs and provide smooth playbacks. As more diverse use cases are onboarded to REEL, our scale will grow even further and will require a peripheral ecosystem to support growing needs. We want to move more toward making our video processing more efficient and extending our infrastructure to work with eBay’s Artificial Intelligence and Machine Learning platform.", "date": "2020-05-20"},
{"website": "Ebay-Product", "title": "Dark Mode Now Live on eBay Native Apps", "author": ["Bradford Shellhammer"], "link": "https://tech.ebayinc.com/product/dark-mode-now-live-on-ebay-native-apps/", "abstract": "eBay becomes one of the first ecommerce companies to launch Dark Mode on iOS and Dark Theme on Android. Today, we are excited to launch Dark Mode on our eBay native devices. Dark Mode is designed to ease the shopping experience, honor device settings, create more accessibility and provide best-in-class service to our customers, and it is one of the newest feature updates our customers are seeing on mobile. eBay is now one of the first ecommerce companies to launch Dark Mode on iOS and Dark Theme on Android. Dark Mode is our customers’ most requested app feature so far in 2020. Today’s digital users know only too well that bright screens can cause eye strain. When eye strain is prolonged throughout the entire day and into the night, our sleep patterns, focus and overall health can be negatively impacted. By implementing a color scheme with light-colored text, icons and graphical user interface elements on a dark background, Dark Mode allows for a comfortable viewing experience that’s easy on the eyes. Meeting all contrast guidelines and standards, Dark Mode also helps customers with light sensitivities and visual impairments navigate the app. As an added benefit, Dark Mode saves battery life due to low power usage. We've updated the native apps to support dark appearance options for both Android and iOS platforms. The applications are presented using either light or dark color palettes depending on user preferences. To access Dark Mode on iOS, a user selects “Display & Brightness” in the iOS Settings app. From there, the user is provided the option to toggle between “Light” and “Dark.” The user also has the option to set an “Appearance Schedule” that dictates when Dark Mode is activated. To access Dark Theme on Android 10 and above, a user enables Dark Theme across their device under Android display settings. In addition, all Android users can enable the theme in the eBay app settings under the “Theme” menu. The user can toggle Dark Theme on and off within the app or the device settings. Through the teams’ mobile explorations, the feature has expanded and evolved to address user feedback, making it more human-centric and touch forward. Teams are now thinking more contextually about handheld devices and considering factors like target sizes and ergonomic positions. This has informed some changes to user interface elements and layout. Bringing Dark Mode to our apps was possible due to eBay’s Component Architecture technology working closely with eBay’s modern Design System technology. Component Architecture is a framework that includes a set of reusable UI components, which define the building blocks of the app at the UI level. This allows design, engineering and product to move quickly, while ensuring our users have a stable and consistent experience. Using these common components in combination with our Design System’s centralized design library allows us to make design theme changes at the platform level. This was critical for supporting Dark Mode relatively quickly. Instead of needing to make a “dark” style change to every button in our apps, for example, we were able to make a single style change to update all buttons. As we roll out Dark Mode, we will review user feedback through multiple channels: customer satisfaction surveys; contacts to customer support; App Store and Google Play reviews; and on social media channels, such as Twitter, Reddit, Facebook, etc.. In addition, we are monitoring app usage metrics, which will give us greater insight on our customers’ experience in using the new theme and how they’re engaging with the feature. Are users sticking with dark mode or switching back and forth? Will we see more nighttime shopping sessions? Longer shopping sessions? Once we learn more about how users are engaging with Dark Mode, we can start defining new features and optimizations based on customer behavior. Elsewhere on our app, users are also seeing updates to the iconography and fonts, along with the navigation bar background’s colors changing to complement users’ chosen theme. All updates to the app including Dark Mode will be available on all iOS devices. The release also includes an equivalent Dark Theme for Android users. The feature is currently rolling out to users in the U.S., U.K., Germany and Australia, and will expand to all other regions in July. We continue to modernize and personalize the customer experience. Everything we do is in service of our customers, and we’ll continue to innovate on their behalf to move our marketplace forward. Experience the new Dark Mode in your mobile settings today.", "date": "2020-06-08"},
{"website": "Ebay-Product", "title": "eBay Makes Search More Efficient Through Personalization", "author": ["Shreya Raval"], "link": "https://tech.ebayinc.com/product/ebay-makes-search-more-efficient-through-personalization/", "abstract": "eBay introduces Best Match to personalize buyers’ search feeds. When buyers search on eBay, the default order of results is called Best Match. It's designed to show the most relevant listings and incorporates a variety of quality, demand and market-driven factors, such as item popularity, pricing, shipping, regions, seller details, etc. eBay has significantly invested in efforts to enhance the machine learning algorithms to improve the quality of search results for buyers. The most recent update to Best Match personalizes the search results for each buyer. eBay’s marketplace is extremely diverse. In a single category you can find inventory ranging from a few cents to hundreds or thousands of dollars. There are 174 million active buyers on eBay, and every individual has their own criteria to define a perfect item and price range for the product they are shopping for. Previously, when users searched for a product on eBay, the Best Match algorithm would show the exact same results, irrespective of the individual needs. We introduced the price propensity feature in search ranking to customize the search results based on a user’s price preference. Price propensity takes into consideration a user's past purchases at eBay, as well as the inventory they were interested in. Based on this information, a machine learned model tries to predict user’s price propensity for future purchases and uses this to surface search results that are personalized to the user’s price preferences. As an outcome, we see customized search results for individual users according to their preferences and higher engagement with those results. Price propensity is just a first step toward personalization in ranking. There are many other factors that we are exploring as part of this work stream. With these features in place, we hope to make the eBay shopping journey for a buyer a simple and efficient experience.", "date": "2020-06-23"},
{"website": "Ebay-Product", "title": "eBay Launches Secure Local Pickup To Simplify The Shipping Experience", "author": ["Shuja  Rahman"], "link": "https://tech.ebayinc.com/product/ebay-launches-secure-local-pickup-to-simplify-the-shipping-experience/", "abstract": "The enhanced feature enables buyers to purchase items online and pick up directly from sellers in their vicinity. This May, we enhanced the Local Pickup experience on the eBay mobile app. Local Pickup provides an alternative shipping solution to transactions facilitated within the same region, enabling buyers to purchase items online and pick up directly from sellers in their vicinity, saving them money on shipping fees. This allows for a more streamlined delivery process. We updated the Local Pickup feature by securing the transaction with a formal tracking event. By using the code scan functionality, the transaction history is immediately updated with a \"Picked Up\" tracking event. This confirms that the exchange took place and formally closes the transaction. In the midst of a global pandemic, promoting the health and safety of our users is crucial to us at eBay. To prevent the spread of COVID-19 during a Local Pickup transaction, we recommend following appropriate social distancing protocols. eBay seller Trad’r Don has been selling through his eBay store Garbsafari since 1998. Hoping to stay competitive during the pandemic, he conducted his first socially distanced, face-to-face transaction using the updated Local Pickup feature. “This was the first time that I was able to use eBay’s QR code for Local Pickup,” said Trad’r Don. “It is very intuitive and gives me access to even more buyers that are right in my backyard. Avoiding a high shipping cost and a means of safely completing a legitimate transaction makes local pickup an attractive option for nearby customers.” Now live on the eBay mobile app, the updated experience leverages camera application and QR code scan capability to confirm and finalize the transaction. For Buyers To pick up a package, a buyer and seller communicate using eBay’s member-to-member platform to identify a meeting location for the transaction. Upon arrival, the buyer provides the seller with the purchase confirmation and a secure eBay QR code. At this point, the seller scans the QR code using the eBay App on their mobile device. For Sellers By scanning the QR code, the seller marks the transaction as completed — in this case, “Picked Up.” The tracking API then generates an eBay Tracking Number with both date and time stamps, and propagates it across eBay selling tools, APIs and buyer delivery experiences. The updated feature ensures a safe transaction for both buyers and sellers, while notifying eBay that an item has been securely exchanged. With this solution in place, eBay provides fulfillment flow clarity and the added security of a pickup confirmation signal, allowing for increased adoption across our marketplace. Disputes and claims are handled easily with the provided tracking data, and any money transacted on eBay is now protected from fraudulent chargebacks. The enhancement to Local Pickup is the brainchild of eBay’s 2018 Hack Week. A team of six employees worked diligently to build an end-to-end shipping solution that would benefit buyers and sellers worldwide. The feature is already enhancing the eBay shopping experience for millions of customers across the U.S. and will continue to roll out in the U.K., Germany, Australia, Canada, France, Italy and Spain this summer. The feature will be available to all buyers and sellers across iOS and Android devices.", "date": "2020-07-06"},
{"website": "Ebay-Product", "title": "eBay Makes Promoted Listings in Search Results More Relevant and Dynamic", "author": ["Shreya Raval", "Yi Liu", "Gajanan  Adalinge"], "link": "https://tech.ebayinc.com/product/ebay-makes-promoted-listings-in-search-results-more-relevant-and-dynamic/", "abstract": "The Promoted Listing algorithm continues to build revenue for the marketplace and makes sellers happy. The success of any ecommerce marketplace is dependent on the successful transaction between the seller and buyer. There are millions of active sellers on eBay, and they constantly try to increase visibility of their listings in order to drive sales. Like any other big marketplaces, eBay also provides sellers the ability to promote their inventory via different programs, one of which is Promoted Listings. By paying an additional ad rate fee, it enables sellers to make their item stand out among billions of listings on eBay. When a seller opts into the program, their item shows up as sponsored on search result pages at a higher rank, increasing the chances of that item selling faster. The program has grown more than 100% over the past couple of years. Implementing a unified ranker for both non-promoted and Promoted Listings has driven the most growth. It focuses on how and when we show Promoted Listings to our buyers and addresses some of the key customer problems. Prior to the new unified ranking, Promoted Listings (PLs) and organic search results were served on the Search Results Page (SRP) from two different tech stacks with different underlying algorithms, which resulted in a sub-optimal buyer experience. Some Promoted Listings were showing up in fixed slots. The queries with poor quality Promoted Listings were showing irrelevant or low-quality results in those fixed slots. eBay strives to provide an equal opportunity for all sellers to gain visibility while also preserving the buyer experience. The unified ranker introduces the ability for non-promoted and Promoted Listings to compete for top search slots with the objective to maximize relevance and balance GMB (gross merchandise bought) cannibalization. It ranks promoted items by looking at several factors, including but not limited to, relevancy to the search term, item’s (and seller’s) past performance and the ad rate that the seller has set for the item. We continue to refine our algorithms to give the optimal weight to each factor. For some queries, this means promoted listings on top of search. This usually happens when the competition is high (meaning a large number of items which are relevant to the query are participating in promoted listings, and the ad rates are high). Sometimes, zero promoted listings are in the top of search. This usually happens when there are not enough relevant items to the query, and participation in Promoted Listings or the ad rates are not high. The examples below show two queries with different numbers of Promoted Listings based on the above criteria. The relevance of Promoted Listings increased substantially, which lead to increased sales for sellers who participated. This result was a winning combination of happy buyers, happy sellers and a significant increase in eBay’s advertising revenue. This is one of the big product wins eBay had in 2019. This is our first step towards surfacing PLs in floating slots on Search Results Page. Also, this is a new concept introduced in eBay’s dynamic marketplace, wherein promoted and non-promoted listings compete for SRP placements based on quality, conversion and potential revenue. Most other marketplaces like Amazon, Etsy etc. have promoted listings on fixed positions/placements on the Search Results page. As a next step, we are also working to understand the impact on the buyer from Promoted Listings at the top and will optimize the top of search experience based on buyer feedback. On the seller side, while a majority of the sellers have said that Promoted Listings is a great tool to increase visibility and gain traction in the market, we do recognize that some sellers can take advantage of this program by bidding high and dominating the top of search. We will continue to invest in algorithmic improvements that improve the quality and relevance of promoted and non-Promoted Listings at top of Search.", "date": "2020-07-16"},
{"website": "Ebay-Product", "title": "eBay’s Image Clean-Up Feature Brings the Power of Image Processing Algorithms to Android", "author": ["Dzmitry  Lebedzeu"], "link": "https://tech.ebayinc.com/product/ebays-image-clean-up-feature-brings-the-power-of-image-processing-algorithms-to-android/", "abstract": "This feature enables our sellers to create cleaner listings. Editor’s Note: Image Clean-Up launched on iOS and Android devices in February 2020. This article provides several updates for the feature on Android. Powered by computer vision, eBay’s Image Clean-Up feature solves two issues. First, the importance of quality, visual information is increasing every day. eBay needs to constantly improve the visual representation of listings on the platform. Second, we found that most users do not have access to professional photo equipment that can be used to take photos of items on a white background, nor do they have the ability to successfully use photo-editing software. White backgrounds are important for listings to be optimized for Google Shopping, and they improve the shopping experience for buyers by making search look and feel more streamlined. One of the most important decisions in the implementation of Image Clean-Up was to make the entire feature deploy locally on the device with the elimination of any service interaction. Image data is heavy, and we didn’t want to transfer such large amounts of data between client and server. It would also introduce a significant lag for each operation, which is not acceptable due to how critical interface performance is for the user (slower application is one of the top reasons for uninstalls). By removing back-and-forth, client-server communication, our approach allowed for faster image processing. This was made possible by our close partnership with the Computer Vision team, who developed a powerful image processing algorithm and built a native library responsible for processing images on mobile platforms. The feature consists of two paths – auto-cleanup and manual touch-up. This allows us to meet the needs of all user categories, providing the functionality in both automated (for quick and easy editing) and manual (for more fine-grained image tuning) modes. From a technical perspective, the feature on Android is isolated in a separate module, which increases build speeds and testability. The module can also be made dynamic in the future, which would enable the feature to be downloadable on demand. The addition of a native C++ library into the application and the need to support multiple processor architectures like ARM and x86 (both of which have 32- and 64-bit versions and require a separate build of native code) made us rethink how the app is packaged. The result was the implementation of app bundling – the distribution of the app via a bundle with Google Play, building a specific version of the app for each specific device. This allowed for a significant reduction of the app size for each specific user. The Selling team worked closely with the Foundations team to help with app bundling implementation. Since launch, Image Clean-Up has been a huge success: 76% of sellers that used the feature published the listings with the images processed by Image Clean-Up 1 . Image Clean-Up is now live on Android for all users in 16 countries. 1 According to data collected between April 1 - 22, 2020", "date": "2020-07-21"},
{"website": "Ebay-Product", "title": "An eBay Charity Perspective for Developers", "author": ["Shekhar Banerjee", "Diana Dukart"], "link": "https://tech.ebayinc.com/product/an-ebay-charity-perspective-for-developers/", "abstract": "This article explores charity support in Public APIs and hypothetical integration scenario walkthroughs for developers who wish to integrate with eBay for Charity in their eBay-powered experiences. The eBay for Charity program had its beginnings in the aftermath of the September 11th terrorist attacks. Formally launched on eBay’s global platform in 2003, the eBay for Charity program proudly celebrates the generosity of our community with over $1 billion raised towards charitable causes— including $112 million in 2019 alone. Designed to support a wide range of cause areas including disaster relief, child and youth development, animal programs and environmental projects, over 83,000 charities have been integrated onto the eBay for Charity program worldwide. Of these, over 8,000 charities directly sell to support their causes. In addition, over 360,000 eBay sellers have generously contributed from their own proceeds to support a charity. While this program primarily caters to the United States and the United Kingdom, it also has a presence in Canada, Germany, Australia, and Italy. eBay is actively working on expanding the reach of this program into these countries, while exploring potential expansion opportunities in new regions. In the sections below we will cover both the functional and technical aspects of the eBay for Charity program. The eBay for Charity program gives our buyers and sellers a way to invest in causes they care about. As the shadow of the COVID-19 pandemic spreads across the globe, thousands of our community members have stepped in to help others in this hour of need. You can find examples of eBay listings that support efforts to minimize the impact of the pandemic here . In addition to nonprofits that help with COVID-19 relief, the eBay for Charity program supports a range of other efforts. One such example is the \" More Than Words ” job training and youth development program. More Than Words empowers young people in the foster care system, court-involved, out-of-school or homeless to take charge of their lives by leading a business. As another example, human-I-T has been helping students learn at home by getting them the electronics and resources they need to succeed. The nonprofit has delivered thousands of laptops to school districts. Efforts by charities such as human-I-T help close the learning gap and provide less privileged children the opportunity to obtain the skills they need to qualify for technology jobs. You will find many more inspiring stories here . This section covers Charity for Selling, Buying and Fundraising. Charity for Selling There are several facets to the selling experience within the eBay for Charity program. Any eBay seller who wishes to support charity is called a community seller. A charity organization can also sell to support itself, in which case, it’s called a direct seller. In addition, there is support for charities to sell symbolic gifts to support causes with the Gifts that Give Back feature. In all cases, eBay provides fee credits to sellers. Community selling supports sellers who wish to donate anywhere between 10% to 100% of sales proceeds to a charity they love. In the Motors category, the donation can be as low as 1%. The process is straightforward. Whenever sellers are listing items, they simply select to donate, choose any one of the 83,000-plus charities supported by the program, add the percentage they wish to donate—and they are done! Charity discovery is enabled both on the web and through eBay’s portfolio of APIs . eBay also supports seller efforts by crediting a portion of the final value fees and insertion fees for listing for charity. For more information, go here . Besides eBay fee credits, search results will show that the listing benefits a charity. In the listing itself, the title will display a charity ribbon and the description will show a banner describing the charity. Sellers have reported an uplift in sale conversion for their listings supporting charity. One of our most-supported community seller charities, St. Jude Children’s Research Hospital, has raised a total of over $3 million on eBay. Direct selling supports charities to sell and raise money for themselves and their programs. They receive the same benefits as community sellers with the charity ribbon that displays on listings and the charity banner in the listing descriptions. Since these sellers always donate 100% of their proceeds to their charity, all of their selling fees are credited. For more information, go here. The Gifts that Give Back feature gives buyers a way  to provide direct donations for causes. These symbolic gifts are listed directly by charities to support fundraising efforts for current causes or for ongoing needs. A description of what the money will support is included in the listing description. These gifts have been invaluable in efforts to provide COVID-19 relief along with continuous support for ongoing programs. For more information, go here . Charity for Buying The eBay for Charity program allows buyers to channel their goodwill by purchasing inventory that directly or indirectly aids fundraising efforts for causes or charities they care about. The Browse API , for example, supports search capabilities to surface items that benefit charities. Charity Fundraising Buyers can also support charity during checkout where either a buyer's favorite charity or an eBay-recommended charity is displayed with a list of supported amounts. Buyers can choose a favorite charity on the eBay for Charity U.S. site or U.K. site . Favorite charities will also show up in selling flows for sellers to easily select. Favorites are currently supported only in the United States and United Kingdom. eBay users can manage their donation accounts from the U.S. donation dashboard or the U.K. donation dashboard . This dashboard displays pending donations, donation history, favorite charities and various other settings. The settings include creating an automatic donation payment method to automatically pay your donations 21 days after any sales that involve charity. The 21-day period allows any refunds to happen, if necessary. Sellers can also choose whether they want their contact information shared with the charities they are supporting. This section covers conceptual approaches to integrating Charity with Buying and Selling experiences powered by Public APIs. Selling—A Simple Two-Step Guide to Charity Integration Step 1: Enable charity discovery Enable easy discovery of a seller’s favorite charities using search by keywords or search by registration IDs (which would be EIN in the U.S. or CN in the U.K.) through an integration with Charity Search . Both calls return a paginated collection of charity organization details. The results are sorted by relevance in case of keyword search. Charity API also supports retrieving details for a charity organization for a given charity’s ID. Step 2: Use the selected charity Enable the use of charity ID field from the seller’s selection in Step 1 along with a seller-specified donation percentage while creating or updating an offer for their inventory. It’s as easy as that! Step 1: Enable charity discovery Enable discovery of a buyer’s favorite charities following a similar approach as in Step 1 of the previous section. Buyers should then be able to select multiple charities for Step 2. Step 2: Use selected charities Based on the buyer’s selections in Step 1, use the registration_id field values from the charity API response as charity_ids filter in the Browse call to display items for the selected charities. This filter could be used along with other supported search filters, parameters and field groups. We’re proud to spotlight eBay for Charity, a distinctive program with global impact that spans almost two decades, connects thousands of trusted, active charities with our beloved community and has raised over a billion dollars. eBay for Charity can stake its claim as a platform differentiator. True to the spirit of eBay's principles on powering the world’s largest marketplace through the simple philosophy of “people are good,” eBay for Charity combines goodness with the generosity of millions of our community members in a secure, transparent manner that guarantees trust. The addition of the Charity API to eBay’s portfolio of Public APIs allows developers to fully integrate charitable buying and selling into their eBay-powered experiences. As a reminder, all eBay RESTful Public APIs are released with OpenAPI 3.0 and 2.0 documents for easy integration across multiple technology stacks. As the world grapples with the unprecedented COVID-19 crisis, the eBay for Charity program has played a vital  role, enabling the generosity of our eBay community to seamlessly flow to the charities who have been untiring in their efforts to aid those in desperate need across the globe. There has never been a greater call to push charity to the front and center of buyer and seller experiences.", "date": "2020-08-17"},
{"website": "Ebay-Product", "title": "eBay Virtual Tracking Number Now Live in the UK and Australia", "author": ["Brian Pao", "Shuja  Rahman", "Irene Keay"], "link": "https://tech.ebayinc.com/product/ebay-virtual-tracking-number-now-live-in-the-u-k-and-australia/", "abstract": "eBay’s unique code flows through Royal Mail and Australia Post networks, automating provision of eligible tracking and event data for buyers and sellers. We are committed to helping customers around the world get exactly what they want, when they want it. Now, eBay is making it easier for sellers and buyers in the U.K. and Australia to have visibility of their packages with ease and confidence. This month, we are launching eBay Virtual Tracking Number (eVTN) in the U.K. following a successful rollout in Australia earlier this year. The new feature creates a unique eBay identifier — either on the shipping label itself (in Australia) or within the pre-advice and barcode data (in the U.K.) — allowing Royal Mail and Australia Post to automatically identify them in their networks as eBay packages due to the deep integrations with these carriers. What this means is that, for the first time, sellers using Royal Mail or Australia Post services through in-scope shipping channels don’t have to worry about forgetting to upload their tracking information back to eBay. While sellers are still highly encouraged to upload tracking information, Royal Mail and Australia Post will pick up eBay’s “virtual” tracking number and associate it with the parcel’s ID, allowing them to upload the tracking data on the seller’s behalf, with no further effort needed. In turn, buyers will be updated on the status of shipments 1 posted using eligible services. 2 The new feature associates a unique code (eBay:XYZ1234) with each order at checkout, so when sellers print postage labels off-platform on eligible Royal Mail or Australia Post shipping systems, the carrier can pick up the unique code from the metadata in the address, label barcode or pre-advice. eBay is given the corresponding tracking number with no further seller intervention needed. Directly integrated with our platform, these local carriers are able to provide eBay with available tracking and event data. 2 This means that sellers using Royal Mail or Australia Post will have their tracking numbers uploaded on their behalf 1 if they forget to do so themselves, creating a more seamless shipping experience. The new feature enables eBay sellers and buyers using Royal Mail and Australia Post to have more visibility of their shipments. For sellers who do not currently upload their tracking information onto the eBay site, eVTN will automatically add it for them. 1 On the other end, buyers will be able to view any available tracking and event data on eBay as opposed to tracking off-platform. The code improves the post transaction experience for buyers, increasing visibility of any eligible event data for their shipment’s journey. On a broader scale, eVTN presents new opportunities for eBay to solve seller and third-party shipping solution behaviors with improved tracking and event data. Sellers in the UK can find more information on eVTN, here. Sellers in Australia can find more information on eVTN, here . 1 For Australia Post, only articles received with an electronic manifest are automatically identified. This does not apply for articles lodged over the counter, such as prepaid satchels, that sellers will still need to enter tracking numbers on eBay for. 2 Only tracking and event data visible on the Royal Mail website will be shared with eBay, and only eligible services will have tracking and event data provided. For certain services, tracking and event data will only be made available after an item has been delivered.", "date": "2020-09-03"},
{"website": "Ebay-Product", "title": "eBay Motors: Accelerating With Flutter™", "author": ["Corey Sprague", "Larry McKenzie"], "link": "https://tech.ebayinc.com/product/ebay-motors-accelerating-with-fluttertm/", "abstract": "The UI software development kit enables a consistent user experience across iOS and Android. In December 2018, our team was asked to develop a new Android and iOS experience for buying and selling vehicles on eBay, catered to auto enthusiasts. We were given autonomy to research, design and build the eBay Motors App as we saw fit. However, we needed to go from concept to both app stores in less than a year, and it had to include a feature set that existing eBay users had come to expect. We were both excited and a little intimidated by this opportunity, and we wanted to exceed expectations. Our team had been building native apps together for many years. We knew what we were capable of, and we also knew that this would be a huge undertaking. Building two separate apps with a small team would be nearly impossible if we stuck to traditional native development. In the past, we had researched cross-platform SDKs and had been left unimpressed. Fortunately, just weeks before our team was given its assignment, Flutter 1.0 was released, and it approached the cross-platform problem in a promising new way. Our team had been following the development and preview releases of Flutter, and we were well aware of the enthusiasm that was growing around the technology. The first stable release, as well as Google’s sound roadmap, suggested that Flutter might well be the solution for our team to deliver on both platforms in a compelling way under our aggressive deadlines. On the surface, Flutter certainly seemed to approach UI development in a way that addressed many of our concerns. Still, we knew going all-in on an unfamiliar technology was a risky proposition. Thankfully, our product manager Richard Sipe and designer Thai Dang needed time to develop a product vision, so we had a bit of leeway to properly evaluate if Flutter was the right fit. We scheduled team workshops to learn about Flutter and the Dart language. We approached this with a healthy amount of skepticism and bent over backwards to identify areas where Flutter might not meet our needs. To our delight, the technology stood up to each of our challenges. Before long, even the most skeptical engineers were excited. We found that Flutter enabled us to solve interesting problems faster than we anticipated. The development experience was far more enjoyable and we could quickly build a user experience that was very consistent between iOS and Android. Our team wanted to make a high-quality product and we knew that automated testing was an integral requirement. To our surprise, Flutter’s testing story was among the best we had seen. After several weeks of working with Flutter, we were confident it was our best chance to hit our goals on time. Fast forward nineteen months, our team was able to meet every deadline. Our first beta was in our CEO’s hands within three months of receiving our first product requirements, and a few months later we released our app to the public. We are excited to be the team that positioned eBay among the first enterprise companies to use Flutter in a production app. Our experience has demonstrated how Flutter provides speed and agility, even with all the overhead inherent with an enterprise product. That said, it was not easy. Our team worked hard and dedicated itself to being successful. Along the way, we uncovered unexpected benefits that continue to pay dividends as we have added new features to the eBay Motors App. Let’s get into some of the details. The first challenge was to scale and onboard the rest of our team. We knew we had to hit the ground running once our product requirements started rolling in. No one had prior experience with Dart and Flutter. Everyone spent time learning the new stack, and went through the excellent introductory course at AppBrewery. The harder, but more valuable learning was developing our team working agreement. We had to take two teams, from different backgrounds with different approaches to solving problems, and bring them together into one cohesive unit. This was an arduous process that caused us to shed many of our prior beliefs about developing apps, and forced us to re-evaluate what we truly valued in building quality software. We had fierce discussions about design patterns and architecture, automated testing, and the guard rails that were necessary for us to move quickly, and innovate, without locking us into implementation decisions too early. We can’t overstate how valuable this upfront process was. It allowed us to truly start building this app as one team, and gave us a consistent voice in working with Product. As we began building our app in earnest, we were amazed at the amount of code sharing Flutter enabled us to achieve. Today, our repository consists of: 98.3% Dart code (~220k lines of Dart) 1.1% Scripts, CI, various Automation Tools for our development lifecycle .6% split across Kotlin, Java, Swift and Objective-C This level of cross-platform code sharing far exceeded our expectations. The reality is we rarely spend time thinking about or working on platform specific integration, and instead are able to focus almost exclusively on building product features. Early on, we expected to jump through hoops as we needed to access native capabilities. What we discovered was that it was trivial to integrate with device APIs to enable use of the camera, video capture, machine learning, geolocation, secure storage, and other device capabilities. The Flutter ecosystem provides great plugins for these services. On rare occasions, we wrote our own plugins to encapsulate native 3rd party SDKs. These tasks were approached with uncertainty, but they were all completed in hours. By being able to spend most of our time fully immersed in Flutter code, we realized the holy grail of cross-platform development: everything was truly “write-once.” This held true throughout the entire stack. Everything in the UI from layout, navigation, animation, and localization was shared. All of the business logic, domain models and network stack were shared. All of the table stakes like analytics, crash logging and accessibility features were implemented with shared code. We even got to share a single CI pipeline! Writing software in this fashion was a huge accelerator and allowed us to deliver new features very quickly. One of the benefits and surprises of this high degree of code sharing was the impact it had on our test automation. Flutter’s out-of-the-box testing support outperformed our expectations. We’ve been especially impressed with how deeply we can automate the verification of our app, from complex UI interactions to the finer details of an animation. This is a testament to Flutter’s architecture in that it fully controls the pixels that are rendered across all devices and platforms, but it is also because testing is a first class concept in the framework. You can read more about our testing experience with Flutter in our prior blog post . As we discovered the power of Flutter’s testing support, we agreed to a lofty goal: all production code must have 100% code coverage. While intimidating at first, we learned this was very attainable, and enforced the rule with automation in our pull requests. That automation is still in place today and has never wavered. This upfront discipline and our trust in Flutter’s test framework gave us the confidence to deliver quickly without fear of regression. It is common to build and test some features without ever manually testing on a device. We gained so much confidence in our test suite that our quality engineers started writing production code and became full-time Flutter engineers. The benefits of code sharing are not unique to Flutter, although we would argue that Flutter delivers on the cross-platform promise more successfully than its competitors. However, one of our biggest surprises was that, cross-platform benefits aside, developing in Flutter was far superior to traditional native development. We informally surveyed the team to help validate our decision to use Flutter, and the responses showed the majority of the team believed developing in Flutter was over twice as fast as developing for their prior platform. Perhaps more importantly, 100% of those surveyed enjoyed Flutter development more than iOS or Android. As it turns out, happy developers tend to be more engaged and productive. There are so many other reasons our decision to choose Flutter enabled us to move quickly. We worked alongside Product and Design as a single team, with the shared mentality we were building a single app. Requirements rarely diverged between platforms, and entire classes of work such as managing platform specific backlogs were eliminated. The reduced overhead impacted more than just the engineering team. In many cases, we were able to replace paper prototypes with functioning prototypes for user testing. We did not need to create unique designs based on each platform. Prebuilt Material and Cupertino widgets allowed us to prefer good defaults and create custom user experiences only when needed. This resulted in a consistent end user experience on every device without sacrificing the specific platform mechanics that eBay customers have come to rely on. Designs could then be iterated on in real-time with stateful hot reload, a Flutter feature that allows developers to quickly reload the code on a running device without changing the running state of the app. These unique and interesting changes to the way we work have resulted in increased confidence. We ship a new version of our app on Android and iOS at the same time almost every week. There is never any unintentional feature drift between the two platforms. Time savings layered on top of each other has allowed us to be nimble and quick. For example, in the past, we might be concerned if we rolled out the same feature in both the Android and iOS versions of an app, and our analytics showed the feature was used significantly more on one platform versus the other. In these instances, our first assumption was that the platform with the underused feature contained a programming error. However, with Flutter, the implementations on iOS and Android are identical. We don’t waste time and energy searching for programming errors that don’t exist. The team has continued to add features to the eBay Motor App at a rapid pace, such as a live-chat feature and an escrow account to securely transfer funds to the seller. Flutter has not only met our expectations — it has dramatically exceeded them. This has been much more than a technology choice. In many ways, Flutter has changed and enhanced the way our team operates, making its members demonstrably more productive and happier in their day-to-day work. With speed and agility quickly becoming the new normal, development teams would be well served to look into Flutter for production apps of any size.", "date": "2020-09-08"},
{"website": "Ebay-Product", "title": "eBay Helps Buyers More Easily Discover Competitively Priced Items", "author": ["Prerna Dubey", "Manoj  Kannadasan"], "link": "https://tech.ebayinc.com/product/ebay-helps-buyers-more-easily-discover-competitively-priced-items/", "abstract": "eBay recently launched a new feature that helps buyers find things easily on the Search page by highlighting competitively priced items from trusted sellers. A core eBay advantage is the ability to offer a highly diverse and competitive selection of inventory. Buyers choose eBay for prices and selection, including brands at discount. With 1.5 billion listings to consider, eBay recently launched a new badge feature called “Great Price” that helps buyers find things easily on the Search page by highlighting items which are competitively priced from trusted sellers. “Great Price” should become a trusted signal that will help users discover good prices, narrow down their consideration set and make a purchase decision easily. The new badge called “Great Price” highlights items which are competitively priced amongst similar items from trusted sellers. We have seen an increase in buyer engagement with “Great Price” items that can help drive higher velocity for sellers. We are launching this feature on certain products that are high in demand, based on sales history, impressions and engagement. The appearance or placement of the “Great Price” badge on listings will depend on a variety of factors, including but not limited to: Listings from sellers that meet Above Standard or Top Rated seller status; Listings with condition new and matched to a product in our catalog ; Competitively priced across similar listings on eBay; Item’s price and shipping cost, listing format, terms of service, history and relevance to the user query; and Buyer’s Search terms, browsing site. “Great Price” is not a paid feature and the placement of listings in search results remains subject to Best Match factors. Promoted Listings remains a separate program. If a listing qualifies for both the Promoted Listing and “Great Price” programs, the listing will show both the “Great Price” and Promoted Listing badges. To become part of this program, we encourage sellers to adopt the eBay catalog, price your listings competitively and offer a great service for your buyers! This feature is now live in the U.S., U.K., Germany and Australia on desktop, mobile and native apps (iOS and Android).", "date": "2020-09-11"},
{"website": "Ebay-Product", "title": "eBay Partners with Google Assistant to Bring Voice Control to eBay’s Android App ", "author": ["Evan Thomas"], "link": "https://tech.ebayinc.com/product/ebay-partners-with-google-assistant-to-bring-voice-control-to-ebays-android-app/", "abstract": "A new partnership launches voice control capabilities on our marketplace to meet the needs of our customers by creating a more seamless, modern experience. Our focus is always on our customers, and we are constantly innovating and collaborating to provide a simpler, more modern experience for both buyers and sellers on our marketplace. Starting today, our Android customers can now seamlessly blend voice querying with our eBay app experience to facilitate an end-to-end shopping experience on their Android device. This is our first mainstream experience in the voice sphere: integrating the eBay app with Google's Assistant . eBay is also one of the first ecommerce companies to integrate with Google for this voice capability. In 2020, voice activation as a user experience and interface method has reached a precipice. First of all, COVID-19 has forced many of us to stay at home all day, where we are always in close proximity to our mobile devices. At the same time, the rapidly changing pace of current events has increased behaviors, such as obtaining news or instigating calls or texts to connect, through voice activation. Indeed, the very premise of “tap” or “click” shopping is losing ground. The Smart Audio Report conducted by NPR examined the effect of COVID on voice-controlled devices: 51% of Americans use voice assistants on their smartphones, compared to 61% that use voice assistants overall, representing 85% market usage. This is well more than those who use smart speakers, TVs or cars, which represent the other 15%. 52% of customers are asking their voice assistants one or more queries per day, up from 46% pre-COVID (13% increase). Now, 63% of the U.S. population say they use voice-activated assistants of any kind. In addition, this desire for voice control of all devices is building on an already-growing trend that we’ve seen over the past few years. In the second quarter of 2018 alone, the global market for voice devices grew by 187%. From 2019 to 2020, it’s estimated that 111 million customers in the U.S. used voice control via voice assistants. So when Google approached us as an early adopting key partner for voice control, we were thrilled to explore the space with them. As one of Google Assistant’s first integrated ecommerce partners, we collaborated with Google using our deep linking architecture on four main use-cases, each of them central to our core shopping journey and asking the following such questions: “Hey Google, search for a light blue Sneaker on eBay” will open the app, and search for the query voiced; “Hey Google, find an Omnath, Locus of Creation magic card on eBay” will open the app, and locate the specific item the customer is seeking; “Hey Google, show me my eBay Watch List” will open the app and drop the customer in their watchlist; and \"Hey Google, let me see my eBay purchases” will open the app and drop the customer in their purchase history page. To achieve this voice control access to our marketplace, we exposed entry points in our application to Google Assistant using an actions.xml file . Then we handled requests defined in that file to link to different flows. Google mapped voice queries based on the contents of our actions.xml. By defining the type of action we allow our customers to do, and on which landing page, we can harness Google’s robust capabilities to map that action to human language. With the help of Google’s natural language processing technology, variants of each of the above, in many languages, will be understood and enacted in the experience overall. This enables us to engage with customers all over the world extremely easily. This will make our customers’ experiences more seamless when they have their hands full but want to continue shopping on eBay. We’re excited to find future synergies with Google Voice in the near future and to use this partnership as one of the many ways we are accelerating our tech-led reimagination of our marketplace in service of our customers. The feature is now available worldwide. So for all of our Android customers — we hope you’ll start chatting with your Google Assistant to find your passions on eBay! Sources: Google, Voice Assistant Insights eMarketer Report: US Voice Assistant Users 2019 Quoracreative, Voice Trends Mobile Marketer, The Mobile Voice Study Brafton, Voice Search Statistics in 2019 The Smart Audio Report, NPR & Edison Research Statista, Number of digital voice assistants in use worldwide 2019-2024 Voicebot.ai, Voice Shopping to Reach $40 Billion in U.S. and $5 Billion in UK by 2022", "date": "2020-10-09"},
{"website": "Ebay-Product", "title": "Introducing eBay’s New Time Away Feature to Help Sellers Manage Selling on eBay While on a Break", "author": ["Vikram Shandilya"], "link": "https://tech.ebayinc.com/product/introducing-ebays-new-time-away-feature-to-help-sellers-manage-selling-on-ebay-while-on-a-break/", "abstract": "Time Away is now available to all Sellers and automatically updates the shipping date to make the experience more seamless. Last month we launched the new Time Away feature for all sellers so they can let their customers know almost in real-time when they’re on vacation or away from selling. Like an “out of office” reply, the new Time Away feature allows sellers to schedule their absences and notify customers with an automatic message while they’re away, so buyers know what to expect. Additionally, through the tool, sellers can choose if they’d like to pause or continue their listings on eBay. For our buyers, they can see updated estimated delivery dates for items by a seller who has turned on the Time Away feature. As we innovate on behalf of our customers in creating features like Time Away, we strive to be the seller platform of choice across our marketplace as part of our tech-led reimagination. Sellers can access the Time Away feature through several ways, including their Account Settings, the Seller Hub and My eBay pages. For sellers who’d like to hide their listings while on break, they can use the Pause Selling options in Time Away to automatically hide and unhide their listings based on their time away start and end dates, with only 1-2 hours for the changes to take effect. Pausing sales will hide a seller’s fixed-price listings from search results on eBay and block checkout on their listings while they’re away. Please note that auctions will continue unless a seller manually cancels them. Sellers who’d prefer to continue selling while away will no longer need to manually update their shipping and handling time for their inventory. Our new Time Away feature will automatically adjust the handling due/dispatch timeline and the estimated delivery date so that buyers know what to expect. A message will be displayed on the listings letting buyers know about their absence, return date and the expected delays, including an updated estimated delivery date. Sellers also can adjust their settings, change their end date or cancel their Time Away status at any time. This feature rolled out in September as the holiday season approaches, so sellers can prepare in advance for any well-deserved breaks, allowing them to relax and enjoy their vacation. The new feature is available to all eBay sellers worldwide on desktop and is an update of our original “Vacation Settings” feature experience, which previously had only been available to Store subscribers.", "date": "2020-10-16"},
{"website": "Ebay-Product", "title": "Building a Product Catalog: What we Learned from our University Machine Learning Competition", "author": ["Senthil Padmanabhan"], "link": "https://tech.ebayinc.com/product/building-a-product-catalog-what-we-learned-from-our-university-machine-learning-competition/", "abstract": "We challenged more than 100 college students at seven universities to structure listing data using AI and machine learning. At eBay, we use state-of-the-art machine learning (ML), statistical modeling and inference, knowledge graphs, and other advanced technologies to solve business problems associated with massive amounts of data, much of which enters our system unstructured, incomplete, and sometimes, incorrect. To help surface fresh ideas on how we can solve this problem, we partnered with university students at institutions across the country to host an ML competition to spur more research in the ecommerce domain using our very own dataset — 1 million selected public data from unlabeled listings. What we didn’t expect was the number of learnings that surfaced from the submissions. Here are some of the key takeaways that stood out to us. 1. Students are interested in solving these problems. When we started outreach to universities, we were initially skeptical of the dataset we selected, and whether an ecommerce domain challenge would attract students. Academic curiosity and competitions of this nature typically skew toward the areas of vision and language. On the other hand, commerce doesn't get the required attention, so we were thrilled by the excitement and response. Our original plan was to onboard two university teams, and we surpassed our goal with more than 100 participants from seven universities, spread across 37 teams. Thanks to word of mouth and the uniqueness of the dataset, we realized that there is a genuine interest in this topic by students and researchers alike. 2. A scalable platform and streamlined evaluation criteria are key to a successful ML competition. We assessed various platforms to host the competition and EvalAI proved to be an ideal choice. EvalAI is under an open-source license and allowed architectural flexibility, enabling us to scale efficiently. The challenge is most naturally addressed with an unsupervised learning method. However, in order to evaluate the submissions, we needed to obtain a Golden Set of correctly clustered listings, which proved to be difficult. Even when we sent the same pair of listings to several human reviewers and asked the apparently simple question on whether these two listings were the same, we often received conflicting results, which in turn required several rounds of review. We chose the overall Rand Index as the evaluation criteria, which is an objective measure that evaluates overall accuracy. While the Rand Index served its purpose in evaluating the submissions, we would opt to use a different metric in future challenges that gives a higher weight to pairs of listings that should be identified as being identical. 3. eBay’s unstructured data poses an ongoing challenge. eBay is a platform that allows sellers to enter listing data in an unstructured way. As a result, listings sometimes lack certain information, contain redundant information, etc. While the results obtained by the winning team are promising, the problem is far from being completely solved, and this competition has only affirmed its difficulty. However, the winning method provides a solid baseline, which eBay product teams will continue to build and iterate on. Following a thorough evaluation of the models, methodologies, code, and more, we are excited to announce the winners of eBay's 2019 ML Challenge. The student winner, in a solo member team, was Yang Zhao from Stanford University . In addition, eBay awarded an internship to Rabiraj Bandopadhyay who was part of a runner-up team from the State University of New York-Buffalo . Yang and Rabiraj will join our virtual summer internship program and have the opportunity to work with the eBay product team that is using ML and AI to solve the unique challenge that pertains only to eBay — making sense of more than 1.5 billion listings. Yang Zhao is a Ph.D. student at Stanford University, majoring in Civil Engineering. He is a member of the computational geomechanics group, developing numerical models for anisotropic rocks. Other than academics, Yang is interested in basketball and finance, especially in figuring out how the macroscopic economy works. He has a dual bachelor’s degree in Economy from Tsinghua University and passed the first two levels of CFA exams. Rabiraj Bandopadhyay is a Master's student at SUNY – Buffalo, majoring in Computer Science and Engineering. His key areas of interest are theoretical machine learning, matrix decompositions for neural networks, and linear algebra techniques in unsupervised and supervised learning. His other hobbies include listening to classic rock music and reading nonfiction. Our interns help us reimagine eBay’s marketplace for millions of customers around the world. While today’s climate poses many unknowns for students entering the workforce, we are more committed than ever to providing our interns the best possible learning experience. In response to the COVID-19 pandemic, eBay’s 12-week summer internship will be held virtually to promote the health and safety of our interns. Combining real work experience and programming, the internship will give interns the unique opportunity to see into various business verticals, meet our executives and network with like-minded peers. Throughout the internship, students will be challenged to propose solutions to complex problems that have a positive impact on customers and sellers alike. Congratulations to our winners and huge thanks to all the participants for their enthusiasm and support.", "date": "2020-05-18"},
{"website": "Ebay-Product", "title": "Expanding the eBay Stores Experience to Our Mobile App", "author": ["Minh Tran-Lee"], "link": "https://tech.ebayinc.com/product/expanding-the-ebay-stores-experience-to-our-mobile-app/", "abstract": "The eBay Stores experience is now available on our mobile app for Android and iOS. With the holiday shopping season right around the corner, we’re excited to expand our eBay Stores experience to our mobile app for Android and iOS. By bolstering our eBay Stores experience — previously only available on desktop and mobile web platforms — we are enabling sellers to own their store branding, showcase their inventory and create a more engaging experience. We strive to ensure our customers’ experience across our eBay marketplace is simple, modern and easy to use. For our sellers, we want to continue to create innovative products that empower them and create economic opportunity for all , and for our buyers, we aim to create memorable, enduring relationships that encourage them to return to our marketplace time and time again. Through Stores, our goal is to help drive business for our sellers, increase their exposure and help them build a stronger, more loyal customer base through our eBay app. For our buyers, our Stores experience is an additional avenue where they can engage with a business on eBay and discover inventory from their favorite or saved sellers. The eBay Stores experience on our mobile app (Android) Our data shows that more than half of all marketplace transactions typically occur on our eBay app. By extending the eBay Stores platform to our app, we open the door for businesses to reach another market of customers, while creating a more streamlined shopping experience for buyers across multiple devices. For sellers, the Stores platform offers a diverse array of benefits, from branding to inventory display options. The expanded experience offers sellers new branding modules, where they can add their logo, create billboard banners and add more stories about their business. Sellers also have more merchandising display options, including featured listings and custom Store categories. The Stores platform also offers sellers more features around search engine optimization, such as adding text links in listing titles and in the left-hand navigation menu, so more buyers can find their business easily. Additionally, sellers participating in the Stores experience are eligible for 0% final value fees on transactions driven through our eBay Partner Network (EPN) affiliate marketing referral program.* For buyers, this boost in seller branding from the Stores experience means a more seamless, continuous customer experience across devices. Our buyers want to see who they are buying from on any device and create a relationship with the seller. This update allows buyers to create that relationship, while learning more about the business. It also allows the buyer to see the seller’s latest inventory offerings and take advantage of any available promotions. Preliminary data shows that our Stores experience has seen a traffic increase from our mobile app. We’re excited by these early indications of growth and know the enhancements to the Stores experience on the eBay app will help buyers find what they are looking for this holiday season, which historically is the busiest time of the year for our seller community. For example, the “Search within a Store” functionality will help buyers easily find what they’re looking for. The feature is also launching with more ways to increase Stores’ visibility on our eBay app and drive engagement for buyers, including: New link to Stores from the listing (view item) page; New link to Stores from the listing (view item) page; Social sharing; and Social sharing; and Homepage modules highlighting recommended sellers and linking to their eBay Stores. Homepage modules highlighting recommended sellers and linking to their eBay Stores. Sellers can edit their Store by visiting Seller Hub’s Marketing page . The Stores experience is now live in the U.S., U.K., Germany and Australia on iOS and Android. *Currently, only available to U.S. sellers.", "date": "2020-11-23"},
{"website": "Ebay-Product", "title": "Introducing QR Codes for eBay Shipping Labels", "author": ["Manuela Misani", "Stephan Kraus"], "link": "https://tech.ebayinc.com/product/introducing-qr-codes-for-ebay-shipping-labelsnew-blog-post/", "abstract": "With our new QR codes feature, sellers will no longer need a printer to use eBay shipping labels. Every day, we strive to help entrepreneurs succeed in running their business online through our eBay marketplace. This fall, we launched a new QR code feature to help sellers save time and money in using eBay Labels to ship their items out to customers. With our new QR code offering, sellers will no longer need to print their eBay shipping labels at home. They can now download the QR code on their phone and visit the nearest participating post office or shipping retailer, where they can print the shipping label on the seller’s behalf. With this new feature, sellers can now access the benefits of using eBay Labels , like automatic tracking and shipping discounts, even if they don’t have a printer. As we continue to modernize our platform as part of the tech-led reimagination of our marketplace , product updates like digital QR codes are helping to streamline the seller experience and are important in making eBay the platform of choice for sellers. Instead of printing a shipping label, sellers can receive a QR code through their email and show it at the post office, where they will print the label on the seller’s behalf and ship their item. The seller is notified about this option in My eBay and via email. When entering the shipping flow, the seller is guided to check for the nearest post office equipped with this feature. The seller can select a QR code as the label format and receive it via email or download it directly from the shipping flow. When the seller goes to the post office, they’ll show the QR code on their phone. Once the code is scanned, the post office will provide the shipping label and send the package on its way. If plans change, QR codes can easily be voided or reprinted at no additional cost. While the initial version involves a close partnership between eBay and USPS, we wanted to use an API integration model that would simplify onboarding other carriers in our global marketplace. By introducing a new service which receives data from our carriers and translates it into consistent-looking QR codes on the eBay Labels platform, we’re able to guarantee a consistent user experience for our sellers. Additionally, we used a signature-based method of authenticating the URLs so that we can attach the QR codes in emails without asking sellers to log into their eBay account, while still  ensuring that a seller can only retrieve a valid QR code for their individual label. This feature is now live for all users in the U.S. for USPS domestic labels.We’re working to expand this offering to other carriers in the U.S., as well as other global markets. Additionally, we’re planning to expand the use of QR codes into our return label flows. Shipping with a QR code is now available on desktop and mobile web experience for U.S. customers.", "date": "2020-11-30"},
{"website": "Ebay-Product", "title": "Augmented Reality? Now It’s a Reality with eBay’s New Shipping Tool", "author": ["Thai Hai Pham"], "link": "https://tech.ebayinc.com/product/augmented-reality-now-its-a-reality-with-ebays-new-shipping-tool/", "abstract": "Hear from the product manager who created a new augmented reality feature that helps find the right box to ship items sold on eBay. Congratulations, you just sold your item on eBay! As you bask in the satisfaction of a successful sale—and some extra cash—you come to the realization that now this item needs to be shipped. You don’t have a ruler, and you don’t have a box yet, so you’re left staring at your item as the countdown to your 'ship by' date looms. But what if you could try on virtual boxes and find just the right one to ship your item? eBay’s new shipping tool makes finding that perfect box as simple as holding up your phone. Today, we’re launching a tool that uses augmented reality (AR) to fix real-world problems—letting you hold your phone over a real item and try on virtual boxes. To try this, enter the Selling section of the mobile app and look for ‘Which box?’. You’ll be guided through a few steps to begin, like finding a non-reflective surface (think a wood tabletop). Then, move your phone around while pointing where you’ll eventually place the item. Once you’ve identified the right surface, place your item on it and begin trying on virtual boxes to see which one fits before making your shipping selection. Tap where you want to place the box, use two fingers to rotate and try on different sizes. You can even move around and inspect your item to find the right fit (don’t forget room for padding). Try looking from the top, the front, the sides, and anything in between. You can immediately see if your item sticks out the top or the side and pick another box. Now, you’re ready to buy the right box to ship your item. And that feeling of completing a sale is all-around sweet again. The idea for this feature sparked at our annual companywide Hack Week last July. To create this AR feature, we’re using a few key technologies, built on Google's ARCore platform. To understand your phone’s position in the real world, we use concurrent odometry and mapping, as well as sensors for movement and orientation to determine and synchronize your real and virtual world perspectives. We use feature points to be aware of the environment and create planes and surfaces in AR to represent the real world. When you place a box, we anchor it to the world, and this allows you to move around your item while the virtual box maintains its size and position. This is just one of the many new AR experiences we are creating this year to make shopping and selling on eBay easier. Our new AR shipping tool is currently available in the U.S. on Android devices that support ARCore. BIO Thai Hai Pham is a Product Manager who focuses on Spatial Computing at eBay. He’s also a self-proclaimed DIY extraordinaire and a tinkerer, chasing elegant and simple solutions to complex problems.", "date": "2018-03-19"},
{"website": "Ebay-Product", "title": "Building eBay's Simpler Listing Flow", "author": ["Megan Scurich"], "link": "https://tech.ebayinc.com/product/ebays-new-feature-lets-you-list-items-in-seconds/", "abstract": "On the heels of our latest eBay app update, hear from our product manager who worked on a super fast way to list items onto our Marketplace. How many things would you start selling if it only took seconds to list them? We've updated our listing flow to make it even simpler and faster to start selling your items on eBay. It’s the latest release in our journey to improve the seller experience. The new tool leverages our catalog–or all the information that we have about the billions of items for sale on eBay. Now, you can get your new condition items up for sale in about 10 seconds–and primed for the millions of global buyers on our site. Our goal with this new tool is to help you quickly list those items you want to sell, giving you guidance along the way. We’re using barcode recognition technology that identifies the UPC code and maps the same product you’re holding in your hand to a match in our catalog. From there, you’re taken straight to the listing page with all the information auto-populated. In addition to finding the item for you, eBay provides you with pricing and shipping recommendations derived from more than 20 years of buying and selling data. I think it’s an important differentiator to highlight because no other platform can offer that kind of valuable guidance to sellers. It streamlines the decision-making process and eliminates the need for you to do independent research for similar items on the site. Our new tool is an evolution of the ability to search for a product by barcode to actually being able to list and start selling something simply by scanning a barcode. The update takes advantage of our structured data, providing insight into more than 1.1 billion listings on our site. We then pair that with historical data so that you can quickly list your items at the optimal price point. Once your item is matched to a product in our robust catalog, we’ll provide you with a stock image of the product, and surface a recommended selling price and estimated shipping costs. You can get these recommendations on the summary page and list your item immediately. Suddenly, that daunting pile of ‘sellable items’ is a little less scary. Our new tool is available now on eBay's native apps for iOS and Android.", "date": "2018-04-19"},
{"website": "Ebay-Product", "title": "eBay’s Offers to Buyers Feature Hits $1B GMV", "author": ["Harry Temkin", "Parin Jogani"], "link": "https://tech.ebayinc.com/product/ebays-offers-to-buyers-feature-hits-1b-gmv/", "abstract": "Offers to Buyers reaches new milestone this month. Giving sellers the tools to continue to be successful on the eBay Marketplace is at the core of what we do. In 2019, we launched a new feature called Offer to Buyers (also known as Seller Initiated Offers) and became one of the first companies to empower sellers to give a discount and make more sales. This month, Offer to Buyers reached a huge milestone and surpassed $1 billion in gross merchandise volume (GMV) since Jan 1, 2020. It all started with a simple idea in 2018 that became reality in 2019. With approximately 30% of unsold, consumer-to-consumer (C2C) listings having at least one watcher or one person with the item in their cart, why don’t we empower sellers to reach out to their potential buyers and see if they can close the sale? After all, we were already enabling buyers to reach out to sellers with a best offer. In 2019 we launched this tool to our C2C sellers in the U.S., U.K., Germany and Australia on desktop as a new optional offering, and the response was overwhelming. Sellers were sending thousands of offers to buyers every week, a pace that continually saw double-digit growth. Many business-to-consumer (B2C) sellers came across the experience and were knocking at our doors for this to be available to them, too. Within just a month, the team developed a quick solution for them. With all of the early success happening on browsers, sellers wanted to access this feature on their phones, too. The team quickly pivoted and launched Offer to Buyers on mobile shortly after the desktop launch, which led to an almost instant 50% increase in the number of offers and total GMV. Sellers have shown tremendous enthusiasm for Offer to Buyers, and they are always sharing with us how this feature has enhanced the visibility of their listings. “This tool is fantastic and a total game changer for my business,” says Linda Lightman, CEO and Founder of Linda’s Stuff. “I’ve seen an impact on my sales from the day I started using this tool, and I can’t express how much I love it. It has proven to be so successful that we send offers several times throughout the day- morning, afternoon and evening.” With the popularity of this feature among sellers, we began exploring additional updates which would make the tool even more useful. One update was the ability to counter-negotiate. More than 60% of offers have counters enabled, resulting in about a quarter of all Offer to Buyers transactions. We have seen this as an opportunity for even more listings to be available on this tool. We have taken multiple buyer interest signals (such as Abandoned Cart and Heavy Browse) and made them available to our sellers, enabling around 20% more listings to be eligible to send offers, and we’re excited to continue implementing more such signals in the future. We have also added an option for sellers to automate sending offers, making it easy for sellers to use this tool while also helping them reach more buyers. As we march ahead in our tech-led reimagination, and strive to be the platform of choice for sellers and create lifelong, trusted relationships with buyers, we will continue innovating on behalf of our customers to further their success and create economic opportunity for all.", "date": "2020-12-02"},
{"website": "Ebay-Product", "title": "Consumer Sellers: Getting Paid on eBay Just Got Easier", "author": ["Ragesh  Chettiary"], "link": "https://tech.ebayinc.com/product/consumer-sellers-getting-paid-on-ebay-just-got-easier/", "abstract": "eBay is expanding its management of payments to consumer sellers over the next year. In our journey toward a simpler, more modern managed marketplace, eBay is expanding its management of payments to all consumer sellers by the end of 2021. Beginning in Fall 2020, the expansion simplifies and streamlines the selling experience by providing sellers with one place to sell and get paid, and buyers with new, locally relevant payment options. By enhancing the payments experience to encompass more of our business, we are further building on our work to become the seller platform of choice. Consumer sellers will no longer need to maintain two separate customer service relationships to manage their business and everything can be done in the eBay mobile app, My eBay or Seller Hub on the web. With eBay managing payments, we now control the end-to-end experience for our sellers and buyers. From consolidated fees, customized reports, monthly statements, refunds and returns to labels and tax documentation, sellers will now be able to access everything directly on eBay. To create a seamless payment experience for our customers, we built an experience service layer to aggregate all upstream data and serve platform-specific responses to the desktop, mobile web, and iOS and Android app clients. This experience service layer was built on Node.js, powered by both open-source and in-house platform Node modules. Similarly, the desktop and mobile web clients were built on Node.js using open-source (e.g., Webpack, Babel, React.js, and eBay Skin) and in-house platform Node modules (e.g., eBayUI React components). The in-house platform Node modules are reusable across different UI applications and enabled for plug-n-play into different application codebases. This helps to guide developers in leveraging a consistent UI layout and experience across different pages in the eBay customer journey, and enables our eBay page flows to be mobile friendly and easy to update. Simpler Fees: eBay selling fees will be deducted automatically from sellers’ earnings before they get paid, and fees are immediately shown in transaction details and monthly statements. The remainder of seller earnings will go directly to their bank account. No more PayPal processing fees. No more separate monthly fee payments. Simpler Fees: eBay selling fees will be deducted automatically from sellers’ earnings before they get paid, and fees are immediately shown in transaction details and monthly statements. The remainder of seller earnings will go directly to their bank account. No more PayPal processing fees. No more separate monthly fee payments. Convenient Payouts: Sellers will receive all payouts directly to their bank accounts. Sellers may also choose when to get paid: daily or weekly, as funds are available. Convenient Payouts: Sellers will receive all payouts directly to their bank accounts. Sellers may also choose when to get paid: daily or weekly, as funds are available. Seller Protections: Because earning seller trust is our priority, eBay only asks for the information we need to keep sellers safe and pay out their earnings. We have also simplified claim and seller protections to make the seller experience easier. Learn more on how we will use the information here and how we protect sellers’ personal information here . Seller Protections: Because earning seller trust is our priority, eBay only asks for the information we need to keep sellers safe and pay out their earnings. We have also simplified claim and seller protections to make the seller experience easier. Learn more on how we will use the information here and how we protect sellers’ personal information here . Increased Buyer Choice: Apple Pay is available as a payment option on iPhone and iPad. Google Pay is also available on the eBay site and on the eBay Android App. Buyers can also choose locally relevant payment options like SEPA Direct Debit or Sofort EFT in Germany and Afterpay in Australia. Increased Buyer Choice: Apple Pay is available as a payment option on iPhone and iPad. Google Pay is also available on the eBay site and on the eBay Android App. Buyers can also choose locally relevant payment options like SEPA Direct Debit or Sofort EFT in Germany and Afterpay in Australia. Once a seller receives an email invitation to register for managed payments, sellers will be able to access the new experience in three easy steps. 1.  Confirm your account details 2.  Verify your identity 3.  Add your bank account eBay is currently rolling out its management of payments to sellers in the U.S., Germany, U.K., Australia and Canada, and will be expanding to France, Italy and Spain later in Q1 2021. Learn more at ebay.com/payments .", "date": "2021-01-07"},
{"website": "Ebay-Product", "title": "eBay’s Latest Feature Aims to Inspire with a Store Just for You", "author": ["Evan Thomas"], "link": "https://tech.ebayinc.com/product/ebays-latest-feature-aims-to-inspire-with-a-store-just-for-you/", "abstract": "Hear from the product manager who created our newest personalization experience. I’ve found the perfect store for me. It’s filled with Marvel superheroes, NBA superstars, 80s bands, 90s cartoons, smart home electronics, dragons, luxury watches, retro kicks, Portuguese coffee, and Scandinavian furniture. No other store like this exists in the world. This is my store—the “Store of Evan”—and it’s open 24 hours a day. I am literally the only customer, and it’s not on any city block, it’s on every city block in existence, because it’s in my front pocket. This is the new experience on eBay’s mobile homepage: Interests . eBay’s Interests takes personalization to the next level—nowhere else can you visit a store filled with basketball gear, Herman Miller furniture and even indie board games. But on eBay, you can select the Portland Trail Blazers, Mid-Century Modern and Tabletop Gaming as Interests, and we’ll surface relevant listings on your customized homepage. With more than 1 billion listings in our global marketplace, we are the only company who can actually support the hundreds of constructs of Interests simultaneously. What makes the work that we’re doing with Interests unique is how we’re personalizing based on the things you love in life, not just what you’ve shopped for recently. Interests allows shortcuts into eBay worlds of Heavy Metal, Hiking, Scrapbooking or Nintendo—allowing you to cut through a billion listings and surface items just for you. We’ve constructed an ecosystem of things, more than a category, and centered on the lifestyle of activities, passions and styles. In this new eBay, yoga isn’t just about fitness mats and leggings—it’s about woven blankets, meditation and aromatherapy—things that wouldn’t conventionally fall into the category of “Sports & Fitness.” When my team and I started out, we embodied a philosophy of creating human-centric structures based on simple questions that frame each individual’s shopping experience and will ultimately lead you to find your version of perfect. What do you like to do after work? What do you obsess about? What is your style? Who do you cheer for at concerts or sports games? This is a radically different way of thinking about our taxonomy when compared to products or categories—but it is actually reflective of how real people shop. You don’t want to go into a mall in which every store is “Sweater Store,” “Shoe Store” and “Chair Store.” Instead, you walk into a boho chic clothing store because you’re dressing for Coachella, or you walk into an outdoor store because you love camping. Our aim with Interests is to match the experience of those stores that tap into narrowly focused passions. Creating these human-centric structures out of eBay’s diverse marketplace is quite difficult. We had to consider that each Interest has unique brands, styles, characters and materials that make it distinct, and that only its specific customers know about. Real high-end audiophiles don’t care about Skullcandy. They care about Klipsch speakers and Sennheiser headphones . Knowing this, we built the foundation of Interests with a team focused on curating and researching these attributes. We had to start at the foundation: bring in the people who know, or can research, what those attributes are. Once we identified each Interest based on demand (on and off eBay), and each of its most important attributes, we use or create that metadata in eBay’s Structured Data platform, so we can stitch together thousands of pages and items into our new Interest Taxonomy. eBay already has pre-structured pages with a single brand and single category (like: Wolverine Boots ), but we had to build a capability to attach hundreds of these individual pages’ metadata together, then generate a new SEO rich page at that intersection. In many cases, we had to do that two or three levels deep to adequately create the shopping pathway we aspired to achieve. Doing that for every Interest identified was just the first step. Then, we made the pages diverse and displayed the best of our selection within each concept. Hiking included Wolverine Boots, but it also included Coleman tents , Yeti canteens , Arc'teryx daypacks and more. We spent a long time trying to problem solve how to distill eBay’s massive selection down to singular pages. To keep the pages diverse and fresh, we added a presentation layer on top of our new SEO rich pages that would strategically cycle through inventory to optimize per individual, per Interest, per week. We can control the frequency of how often the pages update, and the inventory selected within each Interest on the fly. If we leave them alone, the weighting of inventory, the SEO traffic and the confidence we have in the inventory can drive the ship all on their own. We sprinkled in some graphic design and imagery, and we now have a page that can have hundreds of millions of permutations and inventory cycling, to keep the hikers of eBay coming back for more. Creating pages is one thing, but to get you to organically find the pages that belong to an Interest during your shopping journey, is a whole different challenge. We want our taxonomy to be the simpler way to dive into eBay for our customers—several hundred that are incredibly distinct, rather than thousands of categories with some so similar in nature that customers don’t know where to begin browsing. That’s where we turned to our data science algorithms. Based on your prior shopping funnel behavior, the types of items you look at, and purchases, we could effectively develop a confidence score that maps you, as a shopper, to Browse pages. Take it one level of data extraction further, and if we see that you are mapped to numerous Browse pages within an Interest construct, then we can implicitly associate you with that Interest at another confidence score. Deeper still, we started looking at the attributes within an Interest that you look at most and recommending other attributes within the same Interest that you’ve never looked at before. We want to do more than just help you find what you’re looking for, but also help you find what you didn’t know you were looking for. This is just the beginning. The Store of You is the eBay of tomorrow. eBay Interests is now live on the eBay app.", "date": "2018-05-17"},
{"website": "Ebay-Product", "title": "How Developers Power eBay’s Product-Based Shopping Experience", "author": ["Curtis Gavin"], "link": "https://tech.ebayinc.com/product/powering-ebays-product-based-shopping-experience/", "abstract": "eBay is moving towards a Product-Based Shopping Experience (PBSE) in 2018. With the new experience, buyers will be able to easily find merchandise that meets their search criteria and quickly decide which products they want to purchase. eBay continues to refine our platform, applications, and tools to make our marketplace the best place to buy and sell. Likewise, we continue to expand and distinguish our developer offerings to enable buyers, sellers, and developers to integrate with eBay in ways that allow customization and scalability. eBay’s product-based shopping experience makes it easy for buyers to find and compare products, identify the best deals, and make purchase decisions with confidence. With the current listing-based experience, searches can yield thousands of different listings and offers that buyers must comb through to find the product, offer details, and seller that are right for them. With the new product-based shopping experience, similar listings are grouped by product and product aspects. With the new experience, buyers get a short list of products with pricing and relevant rating information to help narrow the search. Once buyers select specific products, they can select product aspects, such as color. Then, they simply choose the buy box corresponding to the relevant listing details, such as item condition or listing type, to get the best deal. As the online retail industry moves to a product-based commerce model, buyers have come to expect the simplicity and control provided by a product-based shopping experience. With over one billion active listings, this model is critical to providing our buyers the best retail experience. This will, in turn, enable continued success of eBay and the sellers who use our platform. eBay is taking steps to ensure we provide the best retail standard shopping experience in the industry with the following advancements: eBay’s comprehensive product catalog with high-quality structured product data eBay’s comprehensive product catalog with high-quality structured product data API capabilities that enable sellers to easily retrieve the information they need to fuel a product-based shopping experience API capabilities that enable sellers to easily retrieve the information they need to fuel a product-based shopping experience Capabilities that help sellers and manufacturers continuously grow and refine the contents of eBay’s product catalog Capabilities that help sellers and manufacturers continuously grow and refine the contents of eBay’s product catalog Seller integration options that are simple and scalable Seller integration options that are simple and scalable eBay refers to a seller’s act of associating their inventory with specific products from the eBay catalog as product adoption. Product adoption is required for listings and offers to qualify for inclusion in the product-based shopping experience. While seller participation is not mandatory, by adopting products in the catalog, sellers’ items will be part of a retail-standard experience that will enable buyers to easily find what they want and need. Throughout 2018 and 2019, we will extend this approach to other categories across the eBay catalog in phases—and provide sellers and developers with sufficient advance notice and tools to help them list with the catalog efficiently and effectively. With each phase, we invite contributions from our expert sellers to improve the catalog and help ensure that products in the catalog are accurate and up-to-date. In listing-based commerce, sifting through thousands  of listings creates a convoluted search experience for buyers. However, when listings and offers are associated with products in the eBay catalog, similar listings and offers are grouped, filtered, and easily compared. This is why a product-based shopping experience is optimal. As eBay expands and refines the product catalog and creates relationships between products, buyers will have a much easier experience finding exactly what they need on eBay. For example, buyers might be able to find parts and accessories for their product or they may find competing products for detailed comparisons. Just as the product-based shopping experience simplifies the way buyers shop and make buying decisions on eBay, the product-based selling experience greatly simplifies the process for creating listings/offers on eBay. Once the seller has found the correct product in the eBay product catalog, they can simply attach a listing to a product, leaving them more time to concentrate on more important aspects to the selling process like pricing, shipping service, fulfillment, and returns, to ensure their products are competitive and attractive to buyers in that marketplace. The following sections outline the added or updated API capabilities that help sellers participate in the product-based shopping experience. We’ve updated our metadata APIs to allow users to programmatically determine the listing requirements for a given category and brand with respect to product adoption. Currently, this capability is provided by the GetCategorySpecifics and GetCategoryFeatures calls in the Trading API . Soon, we will add this capability to the Taxonomy API . The Taxonomy API belongs to the new modern family of eBay RESTful APIs, which offer many benefits, including consistent modeling, support for OAuth 2.0, JSON format payloads, OpenAPI specifications, performance benefits, and more. The new Compliance API , also one of eBay’s RESTful APIs, helps identify a seller’s listings/offers that do not meet the product adoption requirements for exposure in the product-based shopping experience. The new Catalog API provides capabilities to find and retrieve product data from the eBay catalog, as well to suggest edits to the catalog product data. With the Catalog API, sellers can find a product that matches various search criteria, including category IDs, keywords, product identifiers, and aspects. It also supports search refinements by applying additional aspect-based filters. Both eBay’s traditional APIs, such as the Trading API, and eBay’s RESTful APIs, such as the Inventory API, make it easy to associate seller items or inventory with matching products in the eBay catalog. Use the createOrReplaceInventoryItem call from the Inventory API to create a new Inventory Item or revise the existing one to associate your inventory with catalog products. Developers integrated with the Trading API can use AddFixedPriceItem and AddItem to associate new listings with catalog products for enabled categories and brands and the corresponding revise calls can be used similarly to associate existing listings with catalog products. Soon, when eBay can identify a “high confidence” match in the eBay product catalog for listings that do not meet product adoption requirements, the Compliance API will provide recommended products. This will significantly speed the process of product adoption. Three newly released methods in the Catalog API allow sellers to suggest edits to the catalog by submitting catalog change requests to create or revise products in eBay catalog. These new methods are now available in the Sandbox environment for early testing and easy integration. The Taxonomy API provides a way to retrieve required and available aspects for a product or category. These aspects serve as a sort of template for product catalog change request submissions. With product-based commerce, it is critical for sellers to understand the competitive forces at play for their inventory in a given marketplace. The Marketplace Insights API, which is currently in a private beta release, provides sellers with data about demand, availability, and trending pricing for a specific product on a given eBay marketplace. This helps sellers make decisions about where and how to sell their inventory on eBay to maximize exposure on product pages and to, ultimately, drive better conversion rates. The Marketplace Insights API is in Beta and is available to a limited group of eBay partners at this time. We’ll provide updates on broader availability in the future. Stay tuned. The RESTful Buy APIs allow eBay partners to create their own shopping experiences, tailored to the needs of their buyers. All of the data provided to and by sellers to help drive eBay’s product-based shopping experience is available to support buy-side applications, as well. Each new API that eBay releases includes a downloadable API contract based on the OpenAPI specification (YAML or JSON). These contracts describe the details of the API interface comprehensively. The OpenAPI specification is the industry standard for describing APIs. An OpenAPI specification is both machine- and human-readable. The OpenAPI specification is community driven and is supported with a large set of mature tools, including Swagger, which provides the ability to generate client code in over 40 programming languages. The OpenAPI Initiative (OAI) controls and administers the OpenAPI specification. OAI is a Linux Foundation project, of which eBay is a member with a seat on the Business Governing Board. eBay has also created a user experience for sellers to submit product change requests for the eBay catalog. That is, eBay has done the integration to save third-party developers time and effort. The URLs to access this experience can be retrieved via the GeteBayDetails call in the Trading API. Whitelisted applications can send sellers to this web flow to create or update products in the catalog and to check the status of their submitted change requests. Third-party applications provide access tokens for their sellers to retrieve a session token needed to initiate the session. As eBay evolves and adapts to stay ahead of commerce trends and user preferences, eBay’s public API portfolio continues to expand and improve to enable third-party developers the means to easily integrate with eBay and to create innovative and valuable experiences for their customers and ours. Product-Based Shopping Experience landing page: https://developer.ebay.com/pbse Spring 2018 Seller Update - Inventory Optimization: https://pages.ebay.com/seller-center/seller-updates/2018-spring/inventory-optimization.html", "date": "2018-06-14"},
{"website": "Ebay-Product", "title": "eBay Introduces Its New Seamless Unified Listing Experience", "author": ["Harry Temkin", "Vivian Gledhill"], "link": "https://tech.ebayinc.com/product/ebay-introduces-its-new-seamless-unified-listing-experience/", "abstract": "The new unified listing experience offers an intuitive and cohesive design across all platforms, simplifying the listing flow and enhancing seller benefits. In today’s digital world, it seems as if we are constantly shuffling between devices, whether it be the phone in our pocket, computer on our desk or tablet when we are on the go. With all of these devices at our disposal, it’s important to have systems in place that provide the same user experience no matter the device we’re on. That’s why we have launched a new unified listing experience for our sellers that is seamless across all platforms. When creating a new listing, sellers will now see a consistent listing experience whether they are on mobile, desktop or tablet. With a clean and intuitive new design, the unified listing experience offers an improved user interface with new technology behind it, providing a productive and cohesive experience for all sellers. We’ve updated the backend of our listing experience to be faster and more modular, which improves efficiencies and enables sellers to easily find what they need to complete a listing. Sellers will notice a refreshed user interface that helps optimize their listing by focusing on the areas that need the most attention, providing recommendations on how best to leverage eBay’s marketplace trends as well as additional guidance to help take the guesswork out of prioritizing listing elements. At eBay, we are always looking for new ways to improve the experience for our sellers and provide the resources needed to grow their business. Our unified listing experience does just that, giving sellers access to tools that can enhance listing images, provide pricing recommendations and save time on future listings. Image Clean-up Now on Desktop With the unified listing experience, sellers can now use Image Clean-up on desktop, otherwise known as the Background Remover Tool, to modify images as they list. Image Clean-up utilizes our computer vision algorithm to process the photo completely, using the processor on sellers’ desktop or mobile app to separate the foreground from the background clutter. Doing so enables them to change the background to a uniform white for a consistent look and feel, which optimizes their listing for Google Image Search and improves the shopping experience for buyers. Saved Preferences We understand that many of our sellers regularly list and sell the same items repeatedly. Rather than having to completely start from scratch with each new listing, our new unified listing experience lets sellers save the options they’ve selected. This will allow those options to remain selected the next time a seller is ready to start another listing, saving valuable time and increasing efficiency. This logic works with the majority of fields and is also applicable for business policies. Competitive Insights Module With our unified listing experience, sellers can leverage our Competitive Insights Module, which provides pricing guidance from Terapeak directly in the listing flow and in active listings. Sellers now have access to key data insights for recommendations on how to accurately price items for optimal sales results. The unified listing experience is now available to the majority of our business sellers across all platforms. We are continuing to evolve this experience to address the needs of our sellers as they begin to utilize these features.", "date": "2021-03-24"},
{"website": "Ebay-Product", "title": "Love It? Find More Like It with eBay’s New Image Search Feature", "author": ["Seema Jethani", "Venkat Medapati"], "link": "https://tech.ebayinc.com/product/love-it-find-more-like-it-with-ebays-new-image-search-feature/", "abstract": "Our latest visual shopping feature helps you discover more items that look like your favorites with only the swipe of a finger. There’s an easier way to find more of what you love on eBay. It’s as simple as dragging and dropping images into the search bar as you shop on our mobile app. When we introduced Image Search last year, we used computer vision to make it easier to find like items from the world around you in our global marketplace. Now, you can explore our marketplace further with just a swipe of your finger. As we continue to make the entire internet shoppable using computer vision, we’re evolving the search experience on eBay to help you more easily find what you want. Starting in August, our new visual shopping feature allows you to drag an image to the search bar to find more items that look like the image that you love. Let’s say you’re looking for a new chair, so you type “egg chair” into the eBay search bar and you see a list of results for your search. If one chair in particular stands out, now you can search for more products that look like it—just drag and drop the image of the chair you like into the search bar to see visually similar results. Our new visual shopping feature is powered by artificial intelligence. We use deep learning networks known as convolutional neural networks to process your images. Behind the scenes, when you submit your image in the search field, the neural network converts your image into a vector representation. Then, the vector representation of the image that you submit is compared against more than 1.1 billion live listings in eBay’s marketplace, using nearest neighbor search. Finally, we surface the best-matched items, ranked by visual similarity. Building this type of feature is particularly challenging when you think of all the different types and styles of images on eBay’s marketplace—there are more than 2.1 billion images—as opposed to clean and uniform images. We had to train our models to cancel out the noise to better understand what you might be looking for and show you items that are visually similar. Over the past several months, we have also invested in training models specifically for visually rich categories such as Fashion and Home & Garden. We focus on images and text labels specific to those categories to return better quality results. As we improve the experience, we are heavily focused on continuing to enhance its quality and integrate more into eBay’s shopping experience. The visual shopping feature will be available starting in August on Android and iOS for the U.S., U.K., Germany and Australia. We’ll continue to evolve it and add more ways to search with images soon.", "date": "2018-07-25"},
{"website": "Ebay-Product", "title": "Introducing eBay's Automated Promoted Listings Campaigns", "author": ["Courtney Mayeda"], "link": "https://tech.ebayinc.com/product/introducing-ebays-automated-promoted-listings-campaigns/", "abstract": "Sellers can now use rule-based technologies to both automate how they promote new listings and adjust their ad rates to stay competitive. At eBay, we are committed to investing in the tools and technologies that our sellers have told us they need to grow and thrive. Promoted Listings enables sellers to help their items stand out among the billions of listings in eBay’s marketplace, only requiring sellers to pay when an item sells through Promoted Listings. Now, with the new Automated Campaigns functionality we’ve just added to the Promoted Listings tool, we’re making it even easier for sellers to surface their items to buyers, increasing their items’ visibility and driving their overall sales. Based on feedback from sellers, we’re continually innovating to find even more ways to reduce time and friction in the ads experience, as well as to help sellers ensure continued success with their ad rates in eBay’s dynamic marketplace. The launch of Automated Campaigns empowers sellers with businesses of all shapes and sizes to more efficiently manage their Promoted Listings. Whether it’s one item or thousands of items, this new functionality eliminates manual work while offering sellers more control over their ad rates. The new functionality is useful for everyone selling on our platform, and is particularly well suited for sellers with high turnover rates and ad rate strategies that prioritize competitiveness or for sellers who desire to minimize setup time on the platform. The simplicity of the new experience is designed to give sellers the confidence to set and forget their Promoted Listings campaigns. Set rules to automatically promote new listings. New rule capabilities make it simple for sellers to streamline how listings are added to their Promoted Listings campaigns. Rules are easily managed with filters like price or eBay/store categories, with more options rolling out soon. For a seller with dynamic inventory, this is a huge time saver. Set rules to automatically promote new listings. New rule capabilities make it simple for sellers to streamline how listings are added to their Promoted Listings campaigns. Rules are easily managed with filters like price or eBay/store categories, with more options rolling out soon. For a seller with dynamic inventory, this is a huge time saver. Automate ad rates to stay competitive. By selecting the “automate suggested ad rate” option, sellers can balance performance and costs by having Promoted Listings automatically adjusted daily to eBay’s suggested ad rates. Sellers looking for more control can simply set an ad rate cap, or even use the suggested ad rate as a benchmark and adjust their rate above or below to protect profit margins. Automate ad rates to stay competitive. By selecting the “automate suggested ad rate” option, sellers can balance performance and costs by having Promoted Listings automatically adjusted daily to eBay’s suggested ad rates. Sellers looking for more control can simply set an ad rate cap, or even use the suggested ad rate as a benchmark and adjust their rate above or below to protect profit margins. Launch with confidence. Once launched, listing and ad rates are adjusted according to the rules that sellers set, helping to reduce the risk of overspending and making it easy for them to set and forget their campaigns . Sellers continue to maintain the same level of reporting and performance visibility they are accustomed to. Launch with confidence. Once launched, listing and ad rates are adjusted according to the rules that sellers set, helping to reduce the risk of overspending and making it easy for them to set and forget their campaigns . Sellers continue to maintain the same level of reporting and performance visibility they are accustomed to. For sellers looking to promote all their listings at the suggested ad rates, it only takes three clicks and they’re done . Any future listings added to the marketplace that meet the rule criteria are then automatically promoted. This enhancement, as well as the streamlined user interface, is another example of eBay’s commitment to our seller community. As seller Alex G. of Urban_Achievers said of the new feature, “This is literally something I wanted. If our strategy is to consume new listings into a campaign, this is more efficient, and would mean more sales for us.” Want to learn more about how sellers can set and forget their Promoted Listings campaigns with confidence? Click here .", "date": "2021-04-13"},
{"website": "Ebay-Product", "title": "From ‘Viable’ to ‘Awesome’: The Thinking Behind eBay’s Product Development", "author": ["Claire Xiao", "Parin Jogani"], "link": "https://tech.ebayinc.com/product/from-viable-to-awesome-the-thinking-behind-ebays-product-development/", "abstract": "Hear from two technologists on how we’re evolving our approach to building new products. Each product we build is sort of like starting a small business. It starts with an idea and a hypothesis of consumer need or desire. Then, we keep building upon this, testing and learning along the way. At eBay, our technology teams work in an Agile model where we focus on building what’s called a minimum viable product (MVP) to test ideas for new products and features. MVPs are essentially prototypes—or the most basic versions of a product that allows us to collect consumer learnings before launching at scale. During this stage, the main focus is on functionality, knowing the experience can be optimized in the future as long as the MVP helps us validate consumer demand. In the product development process, this can lead to less-than-ideal (and sometimes, outright confusing) user experiences. Through an MVP approach, what might actually be the result of a poor user experience—for example, where users cannot discover or navigate through—might be interpreted as a lack of customer need for the feature or product we are testing. Given this possible outcome, we’ve recently shifted our approach to building products. Shifting from 'Viable' to 'Awesome' We don’t just want to build a product that is viable at minimum—we want to build a product that is awesome. When it comes to building products in the MVP model, we seldom talk about creating minimum awesome experiences, but this is precisely what we need to do in order to truly create the best experiences for our customers. An awesome experience can mean different things at various stages of the product life cycle. For a mature product, it means a fluent experience and robust features that foster great user engagement and retention. For a fast growing product that strives to penetrate deeper into the user base, it means a series of moments that delight customers and create viral effects. For an MVP, however, it means a product that only allows us to precisely test product market fit. Let’s consider an example. If you were opening a restaurant with an exotic menu, you might want to test the waters and start a food truck as an MVP for a few months before deciding to invest further in the restaurant. But a food truck with fantastic food in the wrong location won’t get many customers, while a food truck in a great location with a confusing menu won’t pull through many orders. MVPs can fail sometimes simply because they are confusing, not because they aren’t valuable. Putting the New Model to Work: Promoted Listings Lite Our team employed the MAP approach with Promoted Listings , an advertising product for business sellers that allows them to boost the visibility of their items with premium placements on eBay and to help enhance their sales velocity. To really push ourselves in how we approached product development, we asked: By optimizing for the user experience, could we quickly validate user demand for a new promoted listings feature? This led us to Promoted Listings Lite. We had a hypothesis that the full Promoted Listings offering had too many options and was too robust for the average consumer seller. Contrary to business sellers who want comprehensive levers to fully control their advertising strategy and grow their business, consumer sellers are less interested in advertising strategy and more focused on getting things sold without hassle. So, we chose to build an MAP that was as simple as possible for our consumer sellers: Promoted Listings Lite. How We Built an MAP 1) MAP = MVP (functionality) + user experience While building our MAP, we made sure to not only focus on functionality but also the user experience. The original Promoted Listings experience for our small business users has full functionality, including manual bidding and campaign creation for advertising, which suits these users’ preferences for more control. Through early user research, however, we found consumer sellers sit on the other extreme of the spectrum: they need a simple, clear and hassle-free experience. To satisfy these needs, we simplified the experience via a one-click campaign creation. To deliver this “advertising easy button,” we recommend a bid percentage and removed the concept of a campaign setting for this segment. In this “lite” version of Promoted Listings, users only need one click to complete the journey. The simplicity of the solution drove wide adoption. 2) Stay relentlessly focused Great companies define their mission and principles to give employees a direction. When it comes to developing a new product, we also aimed to clearly state the questions we sought answers to. This guided our team to optimize for the core functionality and experience while making tradeoffs wisely. As a result, we were able to move faster without sacrificing quality. The key to success for our Promoted Listings pilot was having clear objectives and a relentless focus. To give you one example, there were a lot of debates around adding opt-out and reporting features to our MAP. It was really tempting to slide to the extreme—perfectionism and trying to solve all problems in the pilot. However, in a test-and-learn environment, perfect is the enemy of good. We reminded ourselves that our goal for building the MAP was to validate whether consumer sellers wanted to use a product like this. This enabled us to quickly re-focus our energy on solving only for the critical questions we were seeking answers to. 3) Form a cross-functional tiger team from the beginning MAPs benefit from cross-functional expertise, so it’s a good practice to form a tiger team comprised of engineers, designers, user researchers, marketing experts and data analysts from the beginning of your project planning, and sync on regular basis. Each expert will help your MAP progress in different ways: Engineering partners will quicken product discovery since they can help design solutions that balance agility and delivery time. Engineering partners can also help nail down lean and modular solutions while keeping long-term scalability in mind. Engineering partners will quicken product discovery since they can help design solutions that balance agility and delivery time. Engineering partners can also help nail down lean and modular solutions while keeping long-term scalability in mind. User researchers and marketers can help build the value proposition for the feature and carry them over to go-to-market activities. User researchers and marketers can help build the value proposition for the feature and carry them over to go-to-market activities. A member from the legal team can also contribute to the successful messaging of the product positioning to end customers. Working with this tiger team from the beginning not only helped us launch the new product, but also champion it, making it easier to scale in the future. Shifting our product development approach allowed us to build Promoted Listings Lite quickly and created new opportunities for us to further improve this product line. Promoted Listings Lite is currently available in the U.S., U.K., Germany and Australia.", "date": "2018-08-01"},
{"website": "Ebay-Product", "title": "New eBay Motors Feature Makes Car Schematic Diagrams Shoppable", "author": ["Anny Jeung"], "link": "https://tech.ebayinc.com/product/new-ebay-motors-feature-makes-car-schematic-diagrams-shoppable/", "abstract": "Our Product Managers explain how the new tool lets you shop by diagrams, making it easier to find all the parts you need for your next auto repair job. Have you ever started a repair job on your vehicle only to find you didn’t know the name of the part you needed? You could stop by the local car parts store next time you are out and hope someone there can help you find it. Or you could spend hours researching to find that part ID or description. You might not even know where to start! Our latest motors tool—Shop by Diagram—does all the hard work for you, letting you search and shop for parts visually using interactive diagrams. As we transform ecommerce on our platform, we’ve created a number of different ways to shop and search on eBay, including image search , Find It on eBay and Interests . Now, we’ve built a whole new shopping experience so you can find that part for your next repair job. Shop by Diagram makes it easy to find any auto part by making your car’s schematic diagrams interactive and shoppable. This new feature supplements our current browse and search options by introducing a new shopping experience to mimic what happens in an auto parts store. After you tell us what car you’re shopping for, you select a vehicle system such as brakes or suspension, and then we’ll show you all of the original equipment and aftermarket parts available for purchase on eBay that specifically fit your vehicle. This is a new way of activating our structured data by pairing it with diagrams. To bring this new shopping experience to life, we’ve taken schematics for thousands of North American vehicles from 1985 to today and created an interactive experience for both desktop and mobile web users. All you have to do is select the part on a schematic diagram to identify it. You can get a better look at each part by zooming in and out. We even support pinch and zoom for mobile users. This experience works seamlessly with our existing listings, surfacing only the part you selected from the diagram that will fit your car. To make these diagrams interactive, we’re using scalable vector-based graphics. eBay automotive data specialists map the relationship of each diagram to the appropriate vehicle for that diagram. Then, each part on a diagram is mapped to its correct part description, eBay category, industry standard part type IDm, as well as OEM and aftermarket part numbers. Due to the complex data relationship and the size of the vector files, we are using Elasticsearch to search the diagrams quickly to maintain a fast user experience. Finally, we created a brand new scalable widget platform that will allow us to drop our diagram experience on multiple entry points throughout the site to route you to the appropriate diagram to find your part. You can try this out by: 1. Starting at eBay Motors Home Page . From here, you’ll see a banner that says “Find parts on a diagram.” Next, click “View Diagrams,” enter your vehicle details and select a vehicle system or area of the vehicle. Then browse through all of the available diagrams for that system and select the part you need on the diagram.  Click the “Shop Now” button to go to a search results page where we’ll only show you inventory that fits your particular vehicle. Choose the part you want and continue through the regular check out process. 2. You can also get started directly from your eBay Garage if you have stored your vehicle information in eBay Motors Garage. From here, you’ll see a banner that says “Find parts on a diagram.” Then continue with the same steps above. Shop by Diagram is now live on eBay Motors for all desktop and mobile web users in North America.", "date": "2018-08-16"},
{"website": "Ebay-Product", "title": "Drag and Drop Search: A New Way to Search on eBay", "author": ["Ravi Pitapurapu"], "link": "https://tech.ebayinc.com/product/drag-and-drop-search-a-new-way-to-search-on-ebay/", "abstract": "eBay has over a billion listings across a wide variety of categories that millions of buyers search every day. It is a significant challenge to connect the right buyer to the right listing and in the process to present the user with similar items that are suited to the buyers inputs. Each of those listings has multiple images in various forms and styles. The challenge is how to use computer vision to sift through the billions of listings on eBay and show the buyer visually similar items. The word “similar” could have different implications when we consider that the shopping context varies widely from user to user. To classify our buyers, consider these two scenarios: Let’s say a buyer knows exactly what she wants and searches for it on eBay. From the extensive list of search results, she manages to find something that suits her requirements. Now before she wants to buy it or search elsewhere for a better deal, she may not have selected the best possible item that is available on eBay. Similar listings in this scenario could be a set of listings with all the buying options and price points. Knowing this can enable the user to make a more informed decision. Now, let’s say we have another buyer who has some idea of what he wants. He came to eBay and is exploring all the variety of listings that serve his needs. He browses, looking for that special treasure. We all know eBay has a wide variety of similar items that can serve a specific need, but showing them in relevance could be the challenge. \"Similar\" here could mean different listings from different manufacturers, different quality, or different aspects. eBay has solved some of these key issues by introducing multiple Image Search features. However, there are some limitations, such as the quality of the picture, access to the image, and the clarity of the item we want in the image. How can we address all these points while keeping the user at the center? We present to you our new visual shopping Drag and Drop Image Search experience on the native iOS and Android eBay apps. The idea is to make use of the rich content that our sellers put together and trigger an image-based search while keeping all the aspects in the search context, thereby delivering results that clearly match the users' interests. eBay will be the first ever ecommerce platform that engages the user with this image-based search that adds a fun factor to the search process. How do you use Drag and Drop? Just open the eBay app, search for an item that piques your interest. On the search results page, tap and hold on a listing image. The rest of the flow is intuitive. You see a drop zone where you can drag the listing image and drop it to trigger a visually similar search that is more contextual than ever. (You can also use Drag and Drop on the app's Home page.) The simplicity in the process and the richness in relevant results shows the engineering excellence and the fruits of structured data and emerging computer vision technologies we harbor. The engineering teams at eBay are dedicated to delivering the most intuitive experiences that help delight users on our platform. Touch is the fundamental input means on our mobile platforms. And with touch, we have a host of gestures that could be that much more effective when used in accordance with the right context. The native apps are powered by a host of services, including Experience standard services and the Domain services. Both of these services are governed by certain common guidelines which we call Commerce Operating Standards. Depending on the service layer, we have different frontend components that power the overall experience. We needed a solution that works all over the place. We made use of the Drag interaction APIs from Apple iOS 11.0 that has no dependency on the service layer. However, plumbing the required image data and relevant information called for generic Drag and Drop handlers that could be incorporated on both service standards with little code changes to the View layers. With Drag and Drop APIs, views with content can be dragged from within and outside the host app into specific areas of the host app. But incorporating this into the eBay iOS app came with its own challenges. The Search Results Page is especially tricky, as we have both service versions catering to our user base. All the experiences that we built were following our in-house built Model View Content Controller architecture. The idea behind this architecture is to transform the data models generated from JSON responses to view models. These view models, when passed to a content controller, are translated to views. When adding the Drag and Drop API on the image view inside the listing view, a wrapper for all listing-related subviews is not straightforward. On top of this, the ListingSummaryView is inside the ComponentUI target. All the drag delegate handlers are implemented on the eBay app target, which led to further challenges. To overcome these challenges, we masked the drag handler object as NSObjectProtocol and plumbed it into the ListingSummaryCellModel. This, in turn, is applied by the cell controller to the imageView. For optimization, we reuse this view as the user scrolls down. We add the UIDragInteraction with the delegateHandler each time the view is prepared for use, and remove the same when the view is prepared for reuse. iOS is a big platform for ecommerce that could deliver delightful front end experiences. Visual Shopping is an existing feature on the platform, but bringing it out of the search ecosystem and stitching it with every listing possible is a challenge that we had to overcome. Initial designs were to introduce a button icon to one of the corners over each listing image that could potentially launch a visual search with that image. However the challenge was to capture the users intent to go to a View Item page, but accidentally tapped the icon or vice versa. To solve this, we came up with a drag gesture-based trigger that clearly separates a tap from tap and hold. The next challenge was to present a valid drop zone. We needed some place to drop the dragged image that the user could intuitively feel would initiate a search. At the same time, we should make that drop zone the obvious place to drop the image. We came up with a design to mask all the available area and present a big search box-like drop zone on top of the screen, making it unmistakably the only place you could drop the image. We will continue to improve Visual Shopping, adding more options and expanding the feature to more platforms. eBay continues to spearhead ecommerce with latest intuitive technological advancements and this moves us one step ahead in that direction. Enhancing user experiences and catering to users' needs in more than one way has always been at the core of what we are and what we do. There were many people involved in the design, build and testing of Drag and Drop search without which this could not have been possible. Recognizing them: Jimmy Lui from the Verticals Android Team, the Verticals Product and Design teams, and the Computer Vision team.", "date": "2018-09-27"},
{"website": "Ebay-Product", "title": "New Sellers: Getting Started on eBay is Now Even Easier", "author": ["Anand Ramasubramanian", "Shikha Khanna"], "link": "https://tech.ebayinc.com/product/new-sellers-getting-started-on-ebay-is-now-even-easier/", "abstract": "eBay’s new seller registration process enables anyone to start selling on our modern marketplace with all the necessary tools to reach customers around the world. As eBay empowers people and creates economic opportunity for all, we want to make it as simple as possible to buy and sell on our global marketplace. The debut of eBay’s New Seller Registration makes getting started on our platform easier than ever, simplifying and streamlining the onboarding process so new sellers can register directly on eBay and experience the benefits of managed payments. As we strengthen our trusted marketplace, our approach toward innovation reflects our commitment to becoming a partner of choice for our sellers, and New Seller Registration is another step on this path forward. With New Seller Registration (NSR), newcomers are welcomed to an end-to-end selling experience that is managed by eBay, and sellers no longer need to create a PayPal account in order to sell and get paid. Signing up for an account, listing, transacting, shipping, bookkeeping and customer service are seamlessly integrated into a single managed payments experience. Transaction status, reporting and fees, sales and payout information are all available instantly in a seller’s eBay account, with a cohesive set of protections and policies underpinning each sale. Once a seller account is created, sellers are able to: Centralize their business with a single portal for managing money and a single destination for protections and customer support services Offer buyers more ways to pay, like mobile wallets and locally relevant forms of payment. Checking out is simple and intuitive in our modern marketplace, allowing buyers to focus on discovering great products they love. New Seller Registration is available for both businesses and casual sellers: Business sellers should first create a business account, and then provide their business information, verify their identity and enter their commercial bank details Casual sellers can simply click on “Sell” to list an item, then create a personal account at the prompt by providing identity and banking information before completing their listing When a buyer purchases an item, eBay will seamlessly manage the payment and send the appropriate payout to the seller’s linked financial account directly, with no need for them to transfer funds. Seller Registration is being rolled out now in many markets, with the goal to enable the new experience in all regions by July 2021. As eBay works to manage payments for the majority of eBay sellers this year, we will continue to enhance features that make the experience even more seamless for buyers and sellers around the world, and iterate based on both customer feedback and research metrics. We look forward to discovering new and innovative ways to enhance the shopping journey.", "date": "2021-05-04"},
{"website": "Ebay-Product", "title": "‘Gifts that Give Back’ Program Enhances Listing Options for Over 54k Charities", "author": ["Ethan Rubinson", "Marci Ross", "Scott McDowell"], "link": "https://tech.ebayinc.com/product/gifts-that-give-back-program-enhances-listing-options-for-over-54k-charities/", "abstract": "Revamped Gifts that Give Back Program introduces symbolic gift listings, helping charities raise funds at an exponential rate. From helping victims of the California wildfires to granting the wishes of critically ill children, eBay’s revamped Gifts That Give Back (GTGB) program provides over 54,000 charities the tools to create symbolic gift listings. These gifts may be purchased by millions of generous donors who wish to support their favorite non-profit organizations and the causes they stand for. eBay ensures that every symbolic gift sees 100% of the proceeds go directly to the sponsoring charity. Charities such as St Jude Children's Research Hospital can now create gift listings and raise funds to purchase books , art supplies , physical therapy, and so much more! Originally piloted in late 2016 by eBay for Charity, the GTGB pilot faced several challenges. Notably, charities were unable to create gift listings on their own. Rather, each participant in the GTGB program was required to work directly with the eBay for Charity team to design, create, and manage their gifts; a process which could take up to several weeks. This changed in early 2018 when Ethan Rubinson, a Software Engineer at eBay, secured funding through eBay’s Innovation Programs to revamp the GTGB program enabling it to scale for the global market. Ethan, with the support of Marci Ross, Scott McDowell, and the entire eBay for Charity team, successfully launched the revamped program early this year. The revamped GTGB program features a new gift creation experience for charities, allowing them to create gift listings in just a few minutes. Using the GTGB Gift Creator, charities who are currently registered as Direct Sellers on the eBay platform need only specify what the gift is for, its price, how many are available, and a short description of how raised funds will benefit the cause. Then, after uploading a picture, charities can submit their gifts and immediately start sharing their new gift with their donors. Not only can charities share their gifts with their current donor base, but every gift is also discoverable by each of eBay’s 177m active buyers. With the new GTGB program, charities can also choose to automate the delivery of tax receipts and donation certificates to individuals who purchase one of their symbolic gifts. The vision behind the new Gifts that Give Back program is to allow every charity registered on eBay to create unique and personalized listings to help fundraise for a cause. An example we’re extremely proud of, is a recent campaign by Make-A-Wish UK, in partnership with Disney and DanTDM. The campaign used the flexibility of GTGB to create an innovative way to raise additional funds through a virtual gift concept.  The campaign team created a £1 listing, with the proceeds benefiting Make-A-Wish UK and the buyer of the listing being entitled to receive video credit in one of DanTDM’s video. In less than a week, over 1,400 donations were made and the resulting credits can be viewed on DanTDM’s YouTube video . Help fill the world with color by purchasing a gift that gives back today!", "date": "2018-12-28"},
{"website": "Ebay-Product", "title": "How eBay Uses Microinteractions to Delight Customers", "author": ["Ryan Parker", "Prashant Desai"], "link": "https://tech.ebayinc.com/product/how-ebay-uses-microinteractions-to-delight-customers-in-china/", "abstract": "At eBay, we’re always looking for ways to truly localize for all of our international markets. Our design team has spent some time designing and experimenting with exciting new experiences and microinteractions for shoppers in China. Chinese shopping experiences are markedly different than those in the US. The most noticeable difference is in the design language. Chinese ecommerce is incredibly vibrant, fun, and visually engaging. These shopping experiences literally call for your attention at every turn. It’s almost impossible to not stay engaged. If US ecommerce is mac and cheese, Chinese e-commerce is truffle mac and cheese with lobster. To succeed in China, your design choices really need to stand out and connect with shoppers in a meaningful way. We’ve learned through user research that shoppers think highly of companies that continuously invest in their user experience. This is where microinteractions come into play. At the root of it, it’s about getting a shopper's attention when it counts. The question is, where do you direct that attention? How eBay approaches microinteractions Microinteractions are small moments that have the potential to make a big impact, especially in China where investing in the user experience delivers measurable gains in shopper engagement and conversion. At eBay, we believe that microinteractions have the power to transform critical moments in the shopping journey. Through design and research, we’ve identified important moments to add microinteractions and have discovered through experimentation that this can positively impact our conversion metrics. However, we’re not just focused on conversion. We know that microinteractions can positively impact our experience at an even larger scale. They can affect the perception of the brand or the speed of the application . They can impact the trust a user has in the product or help educate users on complex features. They can even simply be used to delight the users at important moments. Microinteractions are often used to draw the users attention to important conversion-based moments in the experience. Think “Hey, click here!” Price Strikethrough Percentage Off Badge Number of People Watching Incentivized Share Button Microinteractions can be used to delight users and celebrate important moments. Think “Woo-hoo! You did it!” Cart Registration Confirmation Microinteractions are often used educate shoppers on complex features in a simple and enjoyable way by showing in addition to telling. Think “Hey, I can help walk you through this.” Journey Map Microinteractions can be used to signal to the user that this platform can be trusted. In China, authentic items are difficult to come by and drawing attention to ecommerce trust signals like a 30-day money back guarantee are critical in creating loyal shoppers. eBay Money Back Guarantee It’s important to not only think about the individual microinteraction, but also think about them as a unit. They should work together in harmony to walk the user through the experience and draw their attention to the right things at the right time. Below you can see how we envision many of these microinteractions working together on an item page. At eBay, if we are unsure about something's impact, we test it. We ran a simple experiment where we rolled out the animated percentage off badge to 50% of our shoppers in the China market. Our hypothesis was that having this percentage off badge animate on the homepage would increase the click through rate (CTR) of an item. The purple percentage off badge is on the top left of the discounted items. After running the experiment for three weeks and exposing a large audience to this animated badge, we were able to get statistically significant results. Those revealed that users who saw the animated percentage off badge were more likely to click an item as compared to those who saw the static percentage off badge. This helps show that animations and microinteractions not only have numerous qualitative benefits, but also strong quantitative ones. This data has empowered us to spend time integrating microinteractions as part of our design system, and we continually look at how to bring these moments to other parts of the customer experience. We’d also like to thank the other members of the design team for their contributions to this project. Thank you Orlando Angel, Fred Zaw, Susie Liu, and Pree Kolari!", "date": "2019-03-06"},
{"website": "Ebay-Product", "title": "eBay Makes Visual Shopping More Intuitive While You Browse", "author": ["Jonathan Chard"], "link": "https://tech.ebayinc.com/product/ebay-makes-visual-shopping-more-intuitive-while-you-browse/", "abstract": "Our newest experience helps you find more products you just can't describe. You’re browsing on eBay and you see a pair of shoes that catches your eye. You like them, but you want to explore your options. Now it’s easy to discover more of what you like with a tap. Our latest feature lets you use words and pictures in a new way to shop, discover and explore on eBay. If you see something that piques your interest while shopping through eBay’s catalog, just tap on the three dots on the top right corner of the listing and start exploring similar items. If this sounds familiar, it’s a feature that couples our advances in computer vision with relevant filters. It’s leveraging existing technologies and putting them together in a way that creates a seamless, intuitive shopping experience. Here’s how to use the feature. Open the eBay app, search or tap browse to visit one of our categories or interests, then tap on the three dots next to an item you would like to explore. This will pull up a screen that lets you explore a number of options related to the item, including the popular “looks like this” feature. See a pair of shoes that inspires you, but they aren’t exactly what you’re looking for? Now you can use this feature to explore the most popular characteristics in that category. Or if you want a look-a-like item, tap “looks like this” to help find similar items. This started as an idea when creating a filter for locally sold items. As my coworkers and I were shopping for local items on eBay, we wanted a way to quickly filter for items in a specific category. Then we thought, “What if we expanded it to searching and browsing?” We took that concept to eBay’s 2018 Hack Week , where we were able to build on the idea. We added more options and integrated with our image recognition capabilities built by the eBay Computer Vision team for “looks like this”. When we designed this feature, we thought hard about which options to put on the menu. We didn’t want to take every aspect of every item, as this would be overwhelming. So we made it concise with just a few options that felt natural. For example, in sneakers, options could be brand, style, color or features. Fewer options make it simple and intuitive for our buyers. By combining pictures and words, this new experience empowers our customers to explore eBay and discover items that they may not have known how to describe. Try it now live on eBay iOS and Android apps in the U.S., U.K., Germany and Australia.", "date": "2019-03-27"},
{"website": "Ebay-Product", "title": "eBay Users Can Save With More", "author": ["Liv Ellingsen", "Steve Neola"], "link": "https://tech.ebayinc.com/product/ebay-users-can-save-with-more/", "abstract": "Volume Pricing saves you money when you buy more of the same thing from eBay sellers. There are things we always need more of when we shop: glass cups, ink cartridges, toilet paper. That’s why eBay recently introduced the Volume Pricing buttons, a faster way to order multiple items and save. Buying more than one of an item isn’t a new idea. As a buyer on eBay, you’ve been able to increase your quantity since we introduced fixed price items in 2002. It doesn’t matter if you’re shopping on desktop or on the app—there are options to type in or select the quantity you want. So why add the buttons? When we recently thought about how to provide valuable information to buyers through design, we thought about volume pricing. Originally the discount had been communicated to the buyers in a plain text box. While it was informative, if you saw it, it could easily be overlooked and was not at all interactive. So we took the original plain text design a step further, combining the information with buttons that stand out on the page and are both informative and actionable. Buyers click a button, see the price, see the discount, know how much more they can save when buying more, and add it straight to their cart. Now, when buyers are searching, they can see “Save when you buy more” taglines that indicates the seller has volume pricing available. If sellers can sell more than one item to the same buyer, it’s a bigger win. The seller spends less time picking and packing items, and can save on shipping costs as well. Plus, the seller is now the person who provided what the buyer wanted, when they wanted it, and with a discount. With 80 percent of the inventory on eBay being new items, there is plenty of scope for sellers to join in. Sellers with a store subscription and listings can add Volume Pricing to their fixed price, multi-quantity listings directly when listing with the tools in Seller Hub. Volume Pricing can also be applied across multiple listings by going to \"Promotions\" under the Seller Hub Marketing tab. If you sell one-off items or don’t list multi-quantities, there are other offer types of discounts that you can offer to your buyers. For example, if you would like to give a discount to a buyer that spends a certain amount with you or purchases three different items, you can do that too. We’re also enhancing Volume Pricing by giving sellers the ability to run this promotion for similar items with multiple variations — things like colors and size — within a single listing. We have made it easier for sellers to offer discounts multiple ways on the platform and for buyers to purchase the way they want. No matter which group you fall into, eBay is working toward a more frictionless ecommerce experience. You’ll see Volume Pricing buttons on mWeb, desktop, iOS and Android in the U.S, U.K, Germany and Australia.", "date": "2019-04-25"},
{"website": "Ebay-Product", "title": "eBay Makes It Easier with Three New Ways for Sellers to Send Offers to Buyers", "author": ["Muthu Sundaresan", "Parin Jogani", "Nainesh Nayudu"], "link": "https://tech.ebayinc.com/product/ebay-makes-it-easier-with-three-new-ways-for-sellers-to-send-offers-to-buyers/", "abstract": "Sellers can now send offers to buyers with an exclusive discount. eBay is giving sellers more tools to reach out to interested buyers so that they can sell more and move faster. Buyers express interest in items listed on eBay in many ways, such as watching those items or adding them to cart. We’re introducing three new ways sellers can send an offer to interested buyers with Seller Initiated Offer — offers to watchers, offers to buyers who have an item in their cart, and offers in message. For example, if a buyer adds shoes to their cart or puts them on their watch list, that’s a signal that a buyer is interested in an item. With Seller Initiated Offers, the seller can go into the Seller Hub (Active Listings) to the specific listing and see that people have shown interest. In a matter of seconds, the seller can send an exclusive offer with a personalized message. This offer will go to buyers that are watching or have that item in the cart. That message reaches up to the 10 most recent people who expressed an interest in the item, ensuring that the offer is always relevant. Sending offers to watchers and offers in message have already launched. We plan to launch offers to buyers with an item in their cart later this year. In an instant, those buyers will receive a notification of the new offer in the app or via email and can make the purchase. We’re excited to create more engagement and opportunities for ecommerce between users. Our sellers asked for this feature through community groups, social media and other channels. The eBay selling team responded to that feedback with this functionality to address the needs of our sellers. Seller Initiated Offers gives buyers another reason to make purchases wherever they are in their day. When we created ​ Best Offer​ , we allowed a buyer to start negotiating on items. Seller Initiated Offers is a way to expand that economic opportunity and help our sellers do more and work faster. This will enable more engagement between sellers and buyers, embracing eBay’s mission of driving ecommerce through innovation. Part of these Seller Initiated Offer tools is offer in message, which is an expansion of how sellers can reply back to buyers. For a long time, buyers were able to send a message to sellers asking for a better price and sellers could reply back with a better offer. Before this update, buyers could only accept that offer through eBay’s website. Now we’ve enabled it through our mobile app, allowing more buyers to shop while they’re on the move. At eBay, we use the approach of continuous delivery and ​ Minimum Awesome Product​ (MAP) to build and test the product adoption, building something nimble enough to test but enjoyable from a user experience perspective. That approach was important to build something that would touch each of the 1.2 billion listings on eBay. After a few weeks of experimenting, we knew Seller Initiated Offers would be a winner with all our users. For buyers, this is another means to connect with our sellers and let them know they’re interested. For sellers, it’s another tool for sellers to use in their business. eBay is about connecting people through ecommerce. In the online world, we think it’s important for a seller to be able to reach out and say, “I want to make a deal. Let’s make it happen.” Seller Initiated Offers — offers to watchers and offers in message — have started to roll out in the U.S., U.K., Germany and Australia on desktop, mobile web and our native apps for iOS and Android. Offers to cart will be available in mWeb, desktop and our native apps on iOS and Android later in the year.", "date": "2019-05-09"},
{"website": "Ebay-Product", "title": " eBay’s New APIs Enable Developers to Create Innovative Experiences at Scale", "author": ["Gail Frederick"], "link": "https://tech.ebayinc.com/product/ebays-new-apis-enable-developers-to-create-innovative-experiences-at-scale/", "abstract": "Managed Payments, Identity and Marketing APIs available today for developers APIs are first-class products at eBay. We continue to add capabilities into our public API portfolio so third-party developers in our eBay Developers Program can create powerful experiences and manage their eBay business at scale. Our goal is to empower developers, enhance the ecosystem of eBay applications, and add value for our buyers and sellers. Starting today, eBay is launching new payments API capabilities that will give our third-party developers access to eBay’s new managed payments program, creating more efficient ways to integrate their businesses. The new Finances API provides developers with a more holistic view of transactions on eBay to more seamlessly manage payouts to bank accounts for sellers enrolled in managed payments, get transaction details, and help sellers with accounting and reconciliation. Finances API is an alpha release intended for developer evaluation and feedback. The Account API adds a new capability to determine whether a seller has opted-in to the managed payments program. And, we added a new refund capability to Fulfillment API that enables managed payments sellers to issue full or partial refunds to their buyers. We have also announced enhanced Promoted Listings capabilities with the Recommendation API . This API provides guidance for Promoted Listings to help sellers optimize their advertising strategy by leveraging trending ad rates and recommended listings. Our third-party developers can use this new capability to competitively elevate sellers’ visibility in sponsored placements across eBay. Reebok saw great success in following eBay’s Promoted Listings recommendations. They promoted more than 100 items at eBay’s trending rate for their multi-quantity inventory. Over the past 5 months, Reebok has seen a 55% lift in overall sales and a 142% lift in sales for the items that were promoted. Additionally, we’re rolling out more new APIs to our developers to help them expand and evolve their offerings, including: Login with eBay - Sign in for new users can feel cumbersome if there are too many steps. We are taking away friction by allowing third-party developers to delegate authentication to eBay by simplifying their integration and improving their new user experience. No need for local authentication or managing identity moving forward, now using Login with eBay, developers will be able to tap into our authentication services to verify their user’s identity. Catch , a new shopping experience created by eBay in Germany, brings fun, inspiration and value by offering cool, trendy and unexpected products at the best prices. Catch has already integrated Login with eBay into its sign-in flow. Login with eBay is currently available for all developers. Login with eBay - Sign in for new users can feel cumbersome if there are too many steps. We are taking away friction by allowing third-party developers to delegate authentication to eBay by simplifying their integration and improving their new user experience. No need for local authentication or managing identity moving forward, now using Login with eBay, developers will be able to tap into our authentication services to verify their user’s identity. Catch , a new shopping experience created by eBay in Germany, brings fun, inspiration and value by offering cool, trendy and unexpected products at the best prices. Catch has already integrated Login with eBay into its sign-in flow. Login with eBay is currently available for all developers. Volume Pricing in Marketing API - Selling more of the same thing allows sellers to save money and time, and move product more quickly. Sellers can now offer a volume discount to their buyers when they buy multiples of the same item. If sellers can sell more than one item to the same buyer, it’s a bigger win. The seller spends less time managing orders, packing items, and can save on shipping costs. Volume Pricing in Marketing API - Selling more of the same thing allows sellers to save money and time, and move product more quickly. Sellers can now offer a volume discount to their buyers when they buy multiples of the same item. If sellers can sell more than one item to the same buyer, it’s a bigger win. The seller spends less time managing orders, packing items, and can save on shipping costs. Offers to Buyers in Negotiation API - This new capability allows Sellers to send offers to buyers that are watching their product with an exclusive discount. Buyers will instantly get notified on their mobile and desktop devices and can accept the offer or counter with the price they would like to pay to purchase. This creates more engagement and opportunities for ecommerce between our buyers and sellers. This capability will be available later this year. Offers to Buyers in Negotiation API - This new capability allows Sellers to send offers to buyers that are watching their product with an exclusive discount. Buyers will instantly get notified on their mobile and desktop devices and can accept the offer or counter with the price they would like to pay to purchase. This creates more engagement and opportunities for ecommerce between our buyers and sellers. This capability will be available later this year. Best Offer Support in the Inventory API and Merchant Integration Platform (MIP) feed solution - Selling applications that use the Inventory API and MIP will be able to adopt and offer eBay’s Best Offer capabilities to buyers. This capability will be available later this year. Best Offer Support in the Inventory API and Merchant Integration Platform (MIP) feed solution - Selling applications that use the Inventory API and MIP will be able to adopt and offer eBay’s Best Offer capabilities to buyers. This capability will be available later this year. Aspect Guidance in Taxonomy API & Trading API - eBay updated the Taxonomy API and Trading API to provide guidance on important item specifics that are required, recommended, and optional for sellers to add into their listings. Required item specifics are the most-searched-for aspects by buyers. Our guidance to sellers is intended to boost their listing visibility. Our algorithms use filled item specifics from these three classifications to power accurate search recall, create search-engine friendly links to seller’s listings as well giving those listings exposure in our search result filters on mobile and desktop. Item specific guidance takes the guesswork out of knowing which item specifics are important. Aspect Guidance in Taxonomy API & Trading API - eBay updated the Taxonomy API and Trading API to provide guidance on important item specifics that are required, recommended, and optional for sellers to add into their listings. Required item specifics are the most-searched-for aspects by buyers. Our guidance to sellers is intended to boost their listing visibility. Our algorithms use filled item specifics from these three classifications to power accurate search recall, create search-engine friendly links to seller’s listings as well giving those listings exposure in our search result filters on mobile and desktop. Item specific guidance takes the guesswork out of knowing which item specifics are important. Consumer Selling API - Earlier, we released the Buy API, that enables buyers to find and purchase inventory from the eBay Marketplace in partner experiences. This year, we are announcing a Consumer Selling API to be released later in 2019. This new API enables users on partner marketplaces to also list their inventory on eBay Marketplace, giving those sellers the additional reach of eBay’s 180M buyers. Consumer Selling API - Earlier, we released the Buy API, that enables buyers to find and purchase inventory from the eBay Marketplace in partner experiences. This year, we are announcing a Consumer Selling API to be released later in 2019. This new API enables users on partner marketplaces to also list their inventory on eBay Marketplace, giving those sellers the additional reach of eBay’s 180M buyers. Open Source Tools for Integration with APIs To simplify integration with APIs, eBay has released open source SDKs and client libraries for processing feeds and integration with eBay OAuth services. These releases complement our current open-source tools, Java OAuth client library and Java Feed SDK . We are excited to see how the developer community will innovate with these tools and look forward to partnering with developers to expand our open-source offerings. Additionally, each year we bring together our most influential and innovative third-party developers to learn about the latest APIs in our portfolio and how to integrate them into their eBay experiences. Today, eBay kicks-off its third annual eBay Connect developer conference at our San Jose Headquarters. eBay APIs/Developers By the Numbers Since October 2016, eBay’s Buy APIs have generated $550M in GMB globally. eBay serves ~150 - 250M API calls per hour. In an average week, eBay serves ~30B API calls. In Q1 of 2019, external developers used our public Sell APIs to: Created more than 700,000 new listings Managed about 2x that number In Q1 of 2019, external developers used our public Buy APIs to: Drive more than $154M GMB globally # of transactions: 3.2M", "date": "2019-06-26"},
{"website": "Ebay-Product", "title": "eBay’s Multi-User Account Access is Now Live to Sellers ", "author": ["Lester Dorman", "Rekha Patel"], "link": "https://tech.ebayinc.com/product/ebays-multi-user-account-access-is-now-live-to-sellers/", "abstract": "eBay is enabling sellers to better manage their business by securely granting access to employees to create drafts, edit and launch listings on their behalf. Editor's Note: This article was updated June 1, 2020, with the most recent MUAA product features. eBay now has a solution for sellers that may need help managing their online businesses. Multi-User Account Access (MUAA) is eBay’s latest feature that enables sellers to grant access to Listings within their Seller Hub in a more private and secure way. Sellers can now add employees or delegates to perform seller activities on their behalf without giving full access to their eBay account. Here’s how it works: Sellers invite employees as users, granting each user specific permissions and access for tasks like editing, drafting and publishing listings. Employees then create an account and can access the Seller Hub in their own view. This provides both users — the seller and the employee — added security and privacy for their eBay account. Check it out on the eBay Account Settings today! If you’d like to learn more about how we implemented this feature, read this Engineering blog post . In 2020, we added two new permission areas, View Orders and Terapeak Research, to the MUAA feature. The View orders permission allows sellers to grant employees access to view their incoming orders in read-only mode. It provides enough information to facilitate the picking and packing of orders to get them ready for shipping. The Terapeak Research permission gives employees access to their employer’s Seller Hub Research tab in order to conduct market research on their behalf. Terapeak Research was fully integrated into Seller Hub earlier in March 2020 and full details of this integration and the capabilities of the product are available in this Tech Blog post . In addition to these new permissions, eBay has expanded MUAA availability to all the sites where Seller Hub is available: United Kingdom, Germany, Australia, Canada, France, Italy and Spain. Sellers on these sites can now delegate access to employees registered in the same country.", "date": "2019-09-19"},
{"website": "Ebay-Product", "title": "eBay Makes Mobile Web Login Easier", "author": ["Shikha Khanna", "Anand Bahety", "Md Kamal Hossen", "Neb Pesic"], "link": "https://tech.ebayinc.com/product/ebay-makes-mobile-web-login-easier/", "abstract": "eBay enables secure password-less login experiences on the web-based version of eBay with WebAuthn. Passwords as an authentication factor are failing in this day and age. The use of passwords present both a security and usability challenge for consumers. Password-less authentication using biometrics has been available for some time on native smartphone apps. eBay apps support biometric authentication on both Android and IOS platforms. Up until recently, biometric authentication has been missing on web-based applications. eBay has now enabled web-based biometric authentication using WebAuthn. WebAuthn is a new standard that allows biometric-based authentication on web thereby removing the need for passwords. Existing eBay users accessing eBay using the Chrome browser on Android devices will now be able to use biometrics to login to eBay. On supported devices, users will get an option to turn on biometrics (fingerprint or facial recognition, depending on what the device supports). Once enabled successfully, users can use biometrics to log into eBay the next time, instead of having to use their password on that device. The return experience for a user that has opted into this feature is shown below. With adoption of the latest industry standard for authentication ( WebAuthn ), eBay is also one of the first major ecommerce companies to enable biometric authentication as a first factor authentication on web browsers. We hope this feature makes using eBay easier and more secure for our buyers and sellers. Note: Supported devices include Android phones with biometrics enabled using the Chrome browser version 75 and higher. We plan to expand to more platforms in the future.", "date": "2019-11-21"},
{"website": "Ebay-Product", "title": "Buy the Items You Love Again and Again on eBay", "author": ["Asheem Sinha"], "link": "https://tech.ebayinc.com/product/buy-the-items-you-love-again-and-again-on-ebay/", "abstract": "eBay is taking the friction out of repurchasing a favorite find on eBay with the new Buy Again button. People come to eBay to get their favorite items from their favorite sellers. The strength of eBay’s marketplace relies on connecting sellers and their listings with buyers. Our customers have shown us they repurchase the same listings across all categories on the site. Whether it’s buying everyday essentials or business and industrial items, they trust the people they have bought from and the items they have received before. However, until now, it wasn’t easy for buyers to land on the same item page to make a repurchase. This is in large part because we have 1.4 billion listings sold by millions of sellers on our site. So today, we are announcing an all new feature called Buy Again. This new button takes the friction out of finding and repurchasing a favorite find on eBay. Now, when buyers go to their My eBay > Purchases page on iOS or to the eBay hamburger menu on Android, they can scroll through a list of their purchases and will see a Buy Again button. This button allows them to quickly purchase that item from the same seller that they have purchased from before. If the same item is not available from the same seller, buyers can use the Buy Similar button. eBay’s search algorithms will then surface similar inventory, using the purchase title. Buyers will see the same product sold by a different seller; the same product in a different variant (think of the same sneaker in different colors); or a similar product (like a different running sneaker from the same brand). It’s that simple. For buyers, our goal is to provide a seamless experience to help discover relevant items to repurchase. For sellers, this is another feature that brings return buyers back to your eBay listings. The Buy Again button is now available in all territories in Purchase history on eBay’s native apps for iOS and Android. It will be available on desktop in 2020. We will also test a dedicated repurchase experience via a Buy Again page, which will make it easier for buyers to find the items that they’d like to purchase again in one place.", "date": "2019-12-05"},
{"website": "Ebay-Product", "title": "Under the Hood of eBay Motors: New App Powered By Advanced Technology Like Flutter, ML and BFF", "author": ["Larry McKenzie", "Corey Sprague", "Andrew Chalkley", "Jake Hall"], "link": "https://tech.ebayinc.com/product/under-the-hood-of-ebay-motors-new-app-powered-by-advanced-technology-like-flutter-ml-and-bff/", "abstract": "eBay introduces the eBay Motors native app, now available for Android and iOS in the U.S. The app was built using cutting-edge tech including machine learning, Backend for Frontend architecture and Flutter, an open source, cross-platform SDK by Google. eBay has long been a place where automobile enthusiasts turn to buy or sell ’67 Ford Mustangs, ’69 Dodge Challengers and other classic cars that were elegant solutions equipped with the most advanced technology of their day. A similar philosophy was taken toward eBay Motors, a new native app for Android and iOS for the U.S. that was announced today. The app’s elegant and easy-to-use interface is built upon cutting-edge technology that is reinventing ecommerce, including machine learning, Backend for Frontend (BFF) architecture, and Flutter, the trending open-source x-platform development SDK created by Google. In the Big Data era, eBay Motors is using these different technologies to leverage massive amounts of information and providing a mobile foundation to simplify and improve the online retail experience. On the eBay site, the way that automobile photos are organized and tagged on a listing can have a significant impact on the buying and selling experience. Someone who wants to sell a car on eBay typically posts 15 to 20 photos of the vehicle. User testing of the eBay Motors app showed that photos which are well-organized into three buckets (car exterior, car interior, and engine) make buyers feel the listing is more trustworthy. Creating a narrative presentation, with well-organized photos and descriptions, can be a complex and expensive endeavor. In developing eBay Motors, we used edge-powered image categorization AI built with firebase autoML, enabling users to create compelling listings with little effort. It works like this: The car seller takes photos of their car on a phone, uploads the photos to their listing, and eBay automatically organizes the photos into the three groupings. This has a significant impact on the perception of the listing. During testing, users gave comments like “This listing must have been put together by a mechanic” due to the intelligent image categorization. The categorization model was built with Firebase AutoML Vision Edge, an easy to access tool for building models which can be sized for use on phones. The original algorithm was constructed by a single engineer in a couple of days, who trained the model using a few hundred photos from existing eBay car listings. The ease-of-development speaks to the maturity of AI and ML, which have moved beyond the province of data scientists to off-the-shelf tools which are available to software engineers. Another testament to the improvement of the technology was the accuracy of the models, which achieves > 95% accuracy after being trained on only a few thousand labeled images. Flutter, Google’s UI toolkit for building beautiful, natively compiled applications for mobile, web, and desktop from a single codebase, has generated a significant amount of interest. We instantly saw its value in developing eBay Motors. Instead of the traditional approach of using WebView or the OEM widgets that ship with the device, the technology uses its own high-performance rendering engine to draw widgets. With only a thin layer of C/C++ code, Flutter implements the widgets, framework, animation, compositing and other system elements in an object-oriented language called Dart. Developers have a significant amount of control over the system. The technology shares a single code base across Android and iOS apps, with a focus on speed and maintaining a native feel. Since we were developing eBay Motors with a relatively small team, the promise of Flutter to speed up the development of the mobile app and reduces the cost and complexity of app production across platforms was enticing. Implementing a new technology like Flutter in a large-scale, production environment always involves risk, of course. The technology moved from beta to Release Preview 1 only a year ago. We spent the first month performing due diligence, and found that Flutter was perfectly suited for a native development where the user interface was so fundamental to what we were doing. A key benefit was faster development. In normal Android and iOS development, for example, it can take several minutes between the time you write the code and see it reflected in the emulator. In Flutter, this step takes only a few seconds. Allowing developers to instantly access their handiwork is critical for implementing an appealing UI that is being iterated rapidly. An additional benefit of flutter is the maturity of its testing solutions. The test automation is so robust that we were able to convert our two QA engineers into software engineers. This allowed us to maximize the talent of our small development team, giving developers a more holistic responsibility for the app as they tested their work as they developed features. As we developed the new app that would add more features as user requirements became clearer, it was apparent that we needed a Backend for Frontend (BFF) architecture, which is ideally suited to create backends for client-facing mobile apps. In BFF, the mobile frontend architecture does not directly access backend services. Instead, the BFF acts as an aggregation and proxy layer between the client and the services that it calls. By definition, the only consumer of the BFF is the native clients; this allows us to place logic in this service which can minimize the number of calls from the client and ensure that payloads sent over the wire are optimized. These qualities of the BFF give users of the eBay Motors app a faster and smoother experience. The BFF architecture provides numerous benefits to a development team that is creating features that require a specific API. Critically, BFF allows the development team to define the API contract, giving them the ability to define the source of the data, how to aggregate it, and other considerations that normally require the assistance of a backend team. As a result, they can define and adapt the API based on UI requirements. By giving the development team this autonomy, developers could quickly iterate the app to provide the best experience for the users. This evolutionary design moves the system to a better, less-coupled state, as compared to a large single-purpose API. BFF, Flutter, and machine learning allowed us to quickly build and iterate on a cutting-edge app that dramatically improves and simplifies the experience of buying and selling cars on eBay. Early feedback from customers who have used the app have found it similar to a classic car – it’s elegant and powerful to drive, but what’s really impressive is what’s under the hood.", "date": "2019-12-12"},
{"website": "Ebay-Product", "title": "eBay Uses Computer Vision to Enable Sellers to Create Cleaner Images", "author": ["Ellis Luk"], "link": "https://tech.ebayinc.com/product/ebay-uses-computer-vision-to-enable-sellers-to-create-cleaner-images/", "abstract": "We built an algorithm that lets users change the background of their listing photos. You only get one shot at a first impression, and listings with a clean white background have the potential to convert better and sell faster. Today, we’re introducing a new feature that uses computer vision technology to make sellers’ listing photos easier on the eyes and more effective in Google Shopping for both Android and iOS. The feature removes the background of a seller’s listing photo and replaces it with a white background, optimizing listings for Google Shopping, and improving the shopping experience for buyers by making search look and feel more streamlined. eBay is an open marketplace where sellers can take their own photos and post them to the platform. We have millions of C2C and small business sellers who may not be able to use a professional photographer or have time for photo-editing software. Because of that, not all inventory is listed and photographed with optimal lighting or a clean white background. The resulting background — often clutter on a kitchen table, closet door or store shelf — creates noise and impacts results when a buyer shops using Image Search to find an item. How It Works Sellers can easily use this feature by going into the Sell flow from their mobile device. After they take or upload their photos within the eBay listing flow on their Android or iOS device, the seller can leverage the background removal tool to make a first pass at adding the white background for any of their photos. The seller can also touch up any missing areas or use the photo as is. The Technology Behind Image Clean-up Our computer vision algorithm processes the photo completely, using the processor on your mobile phone, to separate the foreground from the background clutter. Doing so enables us to change the background to a uniform white for a consistent look and feel. The current approach is based on these assumptions: ●      Pixels along the image border are predominantly background ●      The foreground and background have sufficient contrast to indicate different coloring We built color models for the foreground and background and solved for unknown pixels in the mask using conditional random fields. The output of the algorithm is a mask made up of the probability of foreground for each pixel. For example, when this is 100%, the pixel is entirely associated with foreground and when it is 0%, it is entirely associated with the background. This mask is then used to blend the foreground with a white image resulting in the desired image. The confidence in background removal is measured by a factor that we call “separability,” which estimates how difficult it is to separate foreground from background. The closer the separability score is to the maximum value of 100%, the more likely the algorithm can easily separate foreground from the background. We use this to guide the tool on whether it should show an auto-cleanup result to the user or let the user do manual touchup to remove the background. Low contrast images and images with background clutter will typically produce a low separability score. Images that score close to 100% on separability will trigger a bonus flow through Automatic Cleanup, in which the background removal tool will attempt to remove the background without seller input. The seller can then choose whether they want to use the photo as is, or make edits and do touch ups of their own. The idea for Image Cleanup was conceived during eBay’s Hack Week, an annual company-wide competition challenging our technologists to innovate and reimagine the ecommerce experience. Leveraging the latest advances in computer vision and AI, we continue to work on additional features that will make our users’ lives easier. This feature is now rolling out on Android and iOS devices in U.S., U.K. Germany and Australia and will be rolling out to all other regions in the next month.", "date": "2020-02-26"},
{"website": "Ebay-Product", "title": "A Learning Culture to Propel Innovation ", "author": ["Mazen Rawashdeh"], "link": "https://tech.ebayinc.com/product/a-learning-culture-to-propel-innovation/", "abstract": "A test-and-learn culture is key to building the best experiences for our customers. Editor’s Note: Our newest innovation documentary series takes a look at how anyone can shape the future at eBay. The new series follows our technologists over six months as they create, test and develop their prototypes through our Innovation Program. Customers are at the heart of every new eBay feature or project. We know that what we do impacts the lives of millions who depend on our platform for their livelihood. And, we are passionate about ensuring that eBay buyers and our sellers have a seamless experience. One thing I have learned throughout my career is that as teams strive to deliver for customers, culture and technical skills are equally important. When a culture is unhealthy, new ideas can be stifled. When a culture is healthy, it speeds innovation, encourages collaboration and champions creativity. In a changing landscape, you have to be adaptable to changes around us in order to continue to compete and win. At eBay, we embrace a test-and-learn culture. It is a trusted and transparent environment where our technologists can succeed by trying new things or taking new approaches to solve real problems and improve the customer experience. No matter where someone sits on the team, their ideas and unique views are valuable. Our Innovation Program I love how we bring culture and creativity together in our annual Innovation Program . It is a sandbox-type environment where employees work cross-functionally to make the impossible possible. The journey starts every summer during Hack Week, with thousands of our brightest minds participating worldwide — building, testing and developing hundreds of new prototypes. Following Hack Week, teams submit their projects for eBay’s Expo in the fall, where they pitch their ideas to business leaders in hopes of landing their ideas on our roadmap. Teams collaborate to solve both customer and complex engineering problems at scale. eBay has 1.2 trillion data queries each day! Our data footprint is more than 700 petabytes, which is equivalent of 1.4 trillion songs, 3.5 million hours of movies and is enough to back up the American Library of Congress over 420 times. In 2019, more than 250 working prototypes were created through our Innovation Program, and many of these are incorporated into existing company initiatives. The program celebrates eBay’s test-and-learn culture and our teams’ visionary innovations with honors like the Innovation Rotation Award. Winners are granted four months to step away from their current assignments to focus on developing their projects. I’m very proud of the culture we foster. By rewarding people who aren’t afraid to challenge the status quo, to think the impossible, to dream bigger and to allow their curiosity to roam free, we are building a better eBay in service of our customers, and helping to improve lives around the world. Watch our new innovation documentary series at ebayinc.com/innovation.", "date": "2020-03-04"},
{"website": "Ebay-Product", "title": "How eBay Service Has You Rollin’ on New Wheels", "author": ["Kenny Crookston"], "link": "https://tech.ebayinc.com/product/how-ebay-service-has-you-rollin-on-new-wheels/", "abstract": "Get the details on our new tire installation service from the product manager who helped create it. How easily can you fit four tires in the back of your car? Can they all fit in your trunk or will two of them need to ride in the back seat? With eBay’s new tire installation service, you can shop eBay’s amazing selection of tires and never have to answer these questions. We’re taking our Parts & Accessories game to the next level, making it even easier to actually get your new tires on your car with our tire installation service. As you might have heard , we rolled this service out in Germany today and it will be coming to the U.S. later this summer. I’m excited about this because it simplifies the journey for our customers and it saves them time. We aren’t just getting you the item but helping you take the next step. You can get the best deal on tires on eBay and then get those tires installed by a local company who knows what they are doing. My team built this new product with eBay’s Add-on services, using Elasticsearch’s geospatial search—a tool that lets us quickly search through our database and find available tire installation locations near you. So, when you buy your tires on eBay, you just have to add on the installation and we’ll use that search tool to pull up a list of pre-screened automotive shops near you, including their locations and price details, then based on that information, you can choose where you want them installed. We will use details about the size of the tires and how many you are buying to match you with the right installation service— all thanks to the work of our Structured Data Team . Then we will actually send the tires directly to the installer because of the work of our Checkout Team—the team responsible for building and enhancing your checkout experience—that allows us to update your shipping location on the fly. Once you pick your tires and choose the auto shop, the auto shop will contact you to set up an appointment and all you have to do is show up with your car—your tires will be there waiting for you. This is just one of the many new and cool changes we are rolling out this year on eBayMotors to make your shopping experience even better. Tires→Trunk: Problem solved. BIO Kenny Crookston is a Senior Product Manager at eBay where he focuses on shopping experiences. He loves the unique challenges offered by eBay’s marketplace, working on new experiences for eBay’s very passionate customers and for a tech leadership team that pushes him and his peers to make our experience better. Kenny is also an avid photographer and formerly worked as a photojournalist.", "date": "2017-05-10"},
{"website": "Ebay-Product", "title": "eBay Lets You See It for Yourself in Reviews", "author": ["Andy Chan"], "link": "https://tech.ebayinc.com/product/ebay-lets-you-see-it-for-yourself-in-reviews/", "abstract": "eBay engages its community through product review images. They say a picture is worth a thousand words. Now, imagine that multiplied by 169 million active buyers and the potential that new flexibility with images can bring to the eBay community. Tap into the power of eBay’s community to get insights on a product you’re considering with our new feature that lets you add images to product reviews. We all know the research and time that goes into trying to find the right product. Part of the research experience includes scouring product reviews to find out what people who bought a particular product are saying about it. But what about actually being able to see how other people are using that product? Images bring product reviews to life on eBay, providing a richer shopping experience and activating eBay’s powerful and passionate community. These images in reviews are just one of the ways eBay is fostering a community of trust among its members and helping buyers make well-informed purchase decisions. I saw how powerful images can be when I was shopping for a bike for my 4-year-old son. While researching bikes, reviews gave me helpful insights on details, but the reviews with images actually helped me decide exactly which bike to buy. One reviewer provided images of her son (similar in age and size to my son) on the bike, making me feel confident enough to buy that model. If you aren’t sure which product to purchase, eBay’s product reviews with images can help you make the right decision, and could even save you time and money.  In addition, product images in reviews can also provide insights to sellers on how buyers are using their products and what features matters most to them. We make sure images in eBay reviews are appropriate by working with various teams and data scientists to automatically detect spam, profanity, and non-product related reviews or images. A trained team of moderators provide a final check on every image. Images in product reviews are currently supported in the United States, the United Kingdom, Germany, Australia, Canada—including French Canada—France, Italy, and Spain, on both desktop web and mobile web, and are coming soon to our native apps on iOS and Android. eBay was founded on the value of community and connecting people through commerce—and we’re carrying that idea forward to activate the eBay community through our product reviews platform. BIO Andy Chan is a Lead Product Manager at eBay where he focuses on shopping experiences specifically around product reviews and ratings. He is passionate about building a great experience that helps users feel confident about buying the right products on eBay. Andy is a huge hockey fan and wishes he could lift the Stanley Cup.", "date": "2017-07-06"},
{"website": "Ebay-Product", "title": "Is It the Right Product for You? eBay’s Newest Feature Lets You Ask", "author": ["Brian Livingston"], "link": "https://tech.ebayinc.com/product/is-it-the-right-product-for-you-ebays-newest-feature-lets-you-ask/", "abstract": "Learn how the new Questions & Answers feature lets you leverage the power of the eBay community to buy what you really want. We’ve all been there—shopping for that certain something online, reading product descriptions, reviews, clicking through images of the item—and we still can’t tell if this is the right product for us. Maybe it’s running shoes and you want to know how many uses you can get out of them. Maybe it’s a vacuum and you want to know how quiet is quiet? Or maybe you want to know if that toy is appropriate for your 6-year-old. These are the details we all search for but you can’t really find in product descriptions and images. Out of the 171 million buyers in the eBay community, someone knows the answer to your question—all you have to do is ask. Starting today, we added Questions & Answers to complement Reviews and help you feel good about your purchase because sometimes all you need is a little more information to know that the product you are looking at is the right one for you. You’ve always been able to ask the seller questions, but now you can get even more details from someone that has actually purchased the item within the eBay Community. This new Q&A section, found on the product pages, lets you ask your questions and even find a question that someone else has already asked so you can feel even more confident in what you are buying. It’s a way to pay it forward and help out a fellow buyer. While any eBay user can answer the question and help, we are also using machine learning to find experts in our community who have had relevant experiences with the product you have questions about. The eBay community has contributed millions of reviews and guides and they are already beginning to help answer questions from other members. As we receive more questions, artificial intelligence will power this feature and get smarter, all while our data scientists continue to figure out not only who might be best to answer certain questions based on their expertise on given products but also to understand what questions might be the most helpful for future buyers. Q&As are currently live on mobile web and desktop in the U.S. and will be coming to our app soon. So, next time you have a question about the product you’re looking at, ask away!  eBay’s active community of buyers and sellers are ready to help. BIO Brian Livingston is a Senior Product Manager at eBay where he focuses on increasing buyer confidence in purchases by leveraging the power of content from the eBay community.", "date": "2017-08-29"},
{"website": "Ebay-Product", "title": "Want to Help Your Item Sell? Increase the Chances with eBay’s New Listing Feature", "author": ["Claire Xiao"], "link": "https://tech.ebayinc.com/product/want-to-help-your-item-sell-increase-the-chances-with-ebays-new-listing-feature/", "abstract": "Learn how eBay’s new listing feature makes it easier for business sellers to bump up the visibility of item listings on eBay to have a better chance at selling. When you come to eBay to list that modern-style floor lamp or that rustic farmhouse dining table, how can you give the items you’re selling a chance to stand out from the other millions of home decor listings in our marketplace? How can you give your listings that extra edge? eBay’s new listing feature—Promoted Listings—makes it easier for business sellers to do just that, by giving sellers the option to bump up their item listing to places on eBay with more visibility, so it has a better chance of standing out and selling—faster. All it takes is a few simple clicks while listing that item. We’ll even recommend how much sellers should spend to improve the chances of sales by boosting the visibility of their listing. When we launched Promoted Listings for multi-quantity listings, business sellers who used it had more buyers who saw their listings and their inventory sold faster, boosting visibility by about 30% on average.* With this new feature, business sellers can use Promoted Listings for single quantity and multi-quantity listings. And promoting a listing is effortless. To start, sellers can go to the Marketing Tab on the dashboard and pick from the drop down Promoted Listings, then select the inventory they want to promote and the percentage rate that will be taken out from the final sales price once that item has sold (starting at just 1%). Now this promoted item will be boosted so it’s more visible in search results, on the eBay homepage and on the product pages for similar items. Sellers will also get information for real-time impressions, clicks and sales coming through the Marketing tab on the dashboard, allowing them to make powerful changes to their listings to increase their sales. We’re using machine learning to determine exposure for each listing based on both the predicted likelihood of an item selling and the amount that a seller is willing to spend. As we see more sales go through Promoted Listings, we will be able to better predict the chances of single item sales and make sure that we in turn give that information back to the sellers to better inform their listings through trending rates. This tool is currently live on desktop in the U.S., U.K., Germany, and Australia and will be coming to mobile and other regions soon. We’re continuing to integrate the Promoted Listings tool into the selling journey and make it even easier to use. So, want to increase the chances of selling that item? Try Promoted Listings and ignite those eBay sales! *Based on data from May to June 2016. Measured on 40,000 listings that had sales before they were promoted and had promoted listings sales after they were promoted. Author Bio Claire Xiao is a Product Manager at eBay where she focuses on seller experience. She is also very passionate about artificial intelligence and its potential application to make our everyday life easier and more efficient. She loves reading and spends a lot of time catching up on the newest tech trends. She also enjoys taking deep learning courses.", "date": "2017-09-20"},
{"website": "Ebay-Product", "title": "Find It On eBay: Using Pictures Instead of Words", "author": ["Steve Neola", "Ben Klein", "Max Manco"], "link": "https://tech.ebayinc.com/product/find-it-on-ebay-using-pictures-instead-of-words/", "abstract": "Learn how new eBay features make the entire internet shoppable with just the snap of a photo. Have you ever seen someone wearing something you wanted to buy but you didn’t know where to get it? Or maybe you saw something you liked while reading your favorite blog or flipping through Pinterest but you didn't know where you could buy it, let alone how to describe it in words? There is a saying that a picture is worth a thousand words, but who really wants to write that much when you are trying to find something quickly. Today, eBay announced Find It On eBay and Image Search , two features that will make the entire internet shoppable. These new features bring you a step closer to getting that item you really want, whether it’s brand new or nearly new—it’ll be totally you. Find It On eBay is a new feature in our eBay app and mobile platform that lets you share images from any social platform or web browser. All you have to do is “share” the image with eBay and our mobile app will find listings of the item in that image or others like it. With Image Search , you can take a photo of something you want to buy—or use an existing photo from your camera roll—and put it into the eBay Search bar on our native apps. Then, we’ll show you listings that match the item you are looking for. These features sift through the more than 1.1 billion listings on eBay, creating a seamless shopping experience and helping you find your version of perfect. They also open up new ways to discover unique and fun items that wouldn’t be possible with just using words. Leveraging the latest advances in two core parts of artificial intelligence -- computer vision and deep learning -- these new features make it easier to buy the things that inspire you. When you upload images to run Find It On eBay and Image Search, we use a deep learning model called a convolutional neural network to process the images. The output of the model gives us a representation of your image that we can use to compare to the images of the live listings on eBay. Then, we rank the items based on visual similarity and use our open-source Kubernetes platform to quickly bring these results to you, wherever you are in the world. We developed the idea for Image Search with a small team during eBay Hack Week, an annual company-wide competition challenging our technologists to innovate and reimagine the ecommerce experience. Our project won the competition in 2015, and from then on, our team has grown substantially while we’ve been building these features. We are continuing to work on additional features and expect to launch more computer vision products in the coming months. Find It On eBay and Image Search will be rolling out this Fall. At the time of launch, Image Search will be supported on both Android and iOS and Find It On eBay on Android. So, the next time you come across something you love when you are browsing online, snap a picture and find it on eBay. ### BIOS Steve Neola is a Product Lead for Recommendations and Image Search at ebay. He is captivated by enabling everyone to use images to shop the world’s most diverse inventory no matter where they are or what inspires them. Steve is a huge music fan and can be found at jazz clubs in the West Village when not working at eBay NYC. Ben Klein is an Applied Researcher at eBay, where he works on computer vision, machine learning, and deep learning. Ben leads eBay’s efforts on applying computer vision for search and recommendation systems applications. Prior to joining eBay in 2014, Ben worked at Microsoft Research as a machine learning researcher and developed algorithms that are used by Microsoft Xbox. Ben holds a Master’s degree in Computer Science from Tel-Aviv University and his work has been published in CVPR and ECCV. Max Manco is a Lead Engineer for Image Search and is responsible for its design, performance and scalability. Max joined the eBay Israeli Office in 2011 and has been involved in several key projects in the Structured Data group. In 2015, shortly after relocating to NYC, he started working on Image Search. Max is very passionate about Java, the Spring Framework, and building efficient large scale systems that delight our users.", "date": "2017-07-26"},
{"website": "Ebay-Product", "title": "Search Faster with eBay’s New Grouped Listings View", "author": ["Jon Glick"], "link": "https://tech.ebayinc.com/product/search-faster-with-ebays-new-grouped-listings-view/", "abstract": "Our new Grouped Listings feature makes it easier to find the product you want with just the click of a button. eBay has an unrivaled selection of more than 1.1 billion listings, but sometimes all that selection can be a lot of work to sort through. When you are looking for microwave ovens on eBay, there are almost 10,000 different listings. And as you scroll through the results, you’ll see listings for the same product again and again, just from different sellers. But wouldn’t it be nice to see the product you’re looking for just once in the search results, grouping together all seller listings so you could easily find the best deal? Plus, if that particular microwave wasn’t what you wanted, you wouldn’t want to see it repeatedly in the results. That is where our new Grouped Listings view comes in. For many searches, you’ll now see a [Group Similar Listings] button above the search results that enables you to condense like offerings in your search results so it’s easier to find what you really want. When you group the listings for that microwave oven search, those 10,000 listings condense over 10X into the 953 unique products they represent. We’ve also made the functionality “smart”-- the button will not appear in cases where most of the listings you’d see are unique like antique teapots . We’re using our vast repository of structured data across a wide range of products to group these listings, taking into account everything from unique identifiers like UPC codes and model numbers to product features obtained through artificial intelligence that understands natural language. Our search relevancy algorithms then leverage machine learning to show you the best offer for that product directly in the search results. Our new Grouped Listings feature is just another step toward evolving our search experience from focusing on individual listings to being structured around products. In the coming months, you’ll continue to see us enhancing the experience and expanding our investments in this area.  Grouped listings is currently live on desktop in the U.S., U.K., Germany and Australia, and will be available on mobile soon. Jon Glick is Vice President of Search Product at eBay, where his focus is on streamlining the search experience so it’s easier for people to find what they are looking for and get the best deals.", "date": "2017-10-09"},
{"website": "Ebay-Product", "title": "Transforming the Advertising Landscape on eBay", "author": ["Amir Green"], "link": "https://tech.ebayinc.com/product/transforming-the-advertising-landscape-on-ebay/", "abstract": "Get a behind the scenes look at the tech that’s revolutionizing advertising on eBay. When you’re shopping for an iPhone on eBay, you might see an ad for a mobile service deal to complement your purchase. Or maybe you’re browsing through eBay Motors section and you come across an ad for car insurance. This is because when you shop on eBay, there’s a lot more going on behind the scenes, with advertisers competing in real-time for a chance to get your attention and show you something else that you might be interested in. Let’s take that iPhone example: As soon as you hit “Search,” two distinct events are set off. eBay’s search engine looks for the best match to your search out of the 1.1 billion listings in our marketplace. eBay’s advertising exchange offers millions of advertisers the opportunity to show you an ad -- in real time! So, when you are deciding between the rose gold iPhone or the limited edition red one, various advertisers are competing for a chance to get your attention and show you their ad. This advertising process is called programmatic Real-Time-Bidding. It is an on-the-spot auction, and operates similar to a stock exchange, with publishers and advertisers communicating through an exchange powered by machines. On nearly every page load, eBay runs these types of real-time auctions for ad impressions. But, the standard way of programmatic advertising can slow down webpages and distract buyers from their shopping journey. We want you to get the best search results for that iPhone -- or whatever you are looking for -- as fast as possible, without letting ads slow down the process or disturb your shopping journey. Using programmatic science technology, we built an innovative, unified auction exchange called “parallel bidding.” By building our own advertising technology that leverages server-to-server programmatic pipes, we can improve advertising yield, reduce advertising latency, and enable data-driven control of advertising costs. In a process that only takes a few hundred milliseconds, parallel bidding sends out bid requests to multiple advertising bidders in the exchange in a parallel, simultaneous fashion and replaces the older and slower method of programmatic advertising that sends requests to bidders one at a time. This allows for a truly fair and unified auction, where all advertising bidders have an equal shot at winning the impression and drives up yield. This bidding process also collects bids for ad impressions behind the scenes on the server-side, speeding up the time it takes to load an eBay page and ads on your browser, and improving ad latency by up to 60%. And parallel bidding is in fact the auction house for our programmatic advertising, running and clearing an auction for each ad impression on eBay. The data it collects to make these auctions possible, coupled with eBay’s internal user behavior data, allows for intelligent pricing and cost control. Our goal is to create a valuable experience for both buyers and sellers, while also driving performance for advertisers. We strive to bring together two marketplaces: the shopping marketplace, connecting buyers and sellers; and the advertising marketplace, connecting advertisers and customers. We are continuing to work on parallel bidding with the goal of growing it so that it becomes the main way of showing ads on eBay, benefiting our entire marketplace. BIO Amir Green is a Senior Product Manager at eBay in New York City. He is product owner for the programmatic science team at eBay Advertising, focusing on unified auction mechanics, and building innovative technological solutions that bridge e-commerce and advertising technology.", "date": "2017-10-12"},
{"website": "Ebay-Product", "title": "eBay Authenticate Makes Buying and Selling Luxury Handbags Easy", "author": ["Vipul Bahety"], "link": "https://tech.ebayinc.com/product/ebay-authenticate-makes-buying-and-selling-luxury-handbags-easy/", "abstract": "With our new program, sellers can authenticate their luxury bags, allowing shoppers to buy with confidence. So you want to sell that designer handbag that you aren’t using anymore? With our new authentication program , selling your luxury handbag is simple. Just start listing your eligible luxury handbag, and select “Sell with eBay Authenticate.” You can then ship the item for free to a team of industry experts. Now, sit back and let that team do the rest for you. Behind the scenes, experts authenticate your item through a multi-step process. They take professional photographs, determine the price of the item and then list that designer bag. When a buyer comes across that authenticated handbag, they can shop with confidence. We indicate on the listing page that the item’s authenticity is verified by industry experts. Plus, we’re guaranteeing that any bag you buy through the eBay Authenticate program is the real deal, so much so that if it isn’t, we’ll give you double your money back. And when the buyer receives the bag, it’s packaged in an elegant black box with a card verifying authenticity and item details. As a seller, when you enter the title of the handbag to list it, we leverage machine learning to determine initial eligibility. If the bag is eligible for Authenticate, you will see an option to create an order and send the handbag for authentication. Then, industry experts do the rest. eBay sellers can now use the service to list luxury handbags and wallets valued at $500 or more, and receive 80 percent of the final sales price when selling luxury handbags from 12 high-end brands, including Balenciaga, Burberry, Céline, Chanel, Christian Dior, Fendi, Goyard, Gucci, Hermès, Louis Vuitton, Prada, and Valentino. Currently, eBay Authenticate is live in the U.S. for consumer sellers listing luxury handbags within the twelve eligible brands. We are looking to expand to other items and our business sellers soon. BIO Vipul Bahety is a Senior Product Manager at eBay, where he focuses on enhancing consumer selling services to create a better experience for our customers. Neither eBay nor the industry experts are affiliated with, or endorsed by, any of the eligible brands. Services are provided independent of the eligible brands.", "date": "2017-10-24"},
{"website": "Ebay-Product", "title": "eBay’s New Feature Lets You Organize Your Watch List by Category", "author": ["Gilad Ayalon"], "link": "https://tech.ebayinc.com/product/ebays-new-feature-lets-you-organize-your-watch-list-by-category/", "abstract": "Our new filtering option makes it easier to sift through the Watch List and find what you are looking for. When you are shopping on eBay and you aren’t quite ready to buy—you can add that item to your Watch List and keep track of it while you continue to search. If you’re like me, after a while of shopping and searching, you might end up with more than 30 items from across eBay in your Watch List. I might spend a week or two looking for the best deals on new sneakers. Do I want the latest Stan Smiths ? Tech steel or mint green? I might even take a break and start searching for things for my newborn—and suddenly my Watch List is half Adidas and half Aden + Anais . Maybe I want to see just my shoes or maybe just the baby blankets. Today, we’ve added category filters to the eBay Watch List to help do just that. The new filter feature lets you sift through your Watch List by selecting a specific category of items to view. Watching items on eBay has never been easier with this filtering option that helps you compare and find what you are looking for. When you go to your Watch List, you’ll see different categories for the different types of items you have saved, whether it’s Men’s Shoes or Nursery Bedding! Once you select the category you are interested in filter to, you’ll be able to see all of those specific items in your Watch List. Now, all you have to do is decide which to buy. So, add as much as you want to your Watch List, because this filtering feature will make it easier to sort through. It’s just one of the ways we are expanding the Watch List to make your shopping experience uniquely you on eBay. We’re continuing to improve the filtering system to offer a more flexible and personalized experience. The Watch List category filters are currently live on desktop and on iOS in the U.S., U.K., Germany, Australia, Canada, France, Italy and Spain. They’ll be coming to Android later this year. BIO Gilad Ayalon is a Senior Product Manager at eBay where he focuses on personalization and engagement. He loves the privilege of catering to a diverse, vibrant and global set of engaged customers, and enjoys the unique challenges the scale of eBay’s marketplace offers.", "date": "2017-10-30"},
{"website": "Ebay-Product", "title": "Use Your iPhone X to Shop on eBay with Face ID  ", "author": ["Dave Comer"], "link": "https://tech.ebayinc.com/product/use-your-iphone-x-to-shop-on-ebay-with-face-id/", "abstract": "eBay enables Face ID integration for shopping as easy and secure as ever. From more powerful devices with faster processors, larger screens with richer displays, and seamless biometric authentication options, to the increasingly personalized and streamlined experiences built on top of them, each innovation sets a new, higher expectation for the next, and, as consumers, we expect them to simply work. Apple’s launch of the iPhone X and its much-anticipated Face ID authentication technology was no different. Face ID makes it easier to log in to your phone or your apps. No more having to remember a password or even scan a finger—now all you need is your face. And shopping on the eBay app is just as easy because we’ve enabled Face ID for the latest iPhone X. At eBay, supporting Face ID in our iOS app was key to delivering a great experience and aligned with our promise to make access to eBay feel effortless, while still being secure. Apple made integration with Face ID easy for applications which already supported Touch ID— we only needed to modify our iOS application, and no changes were needed on the server-side. To build the feature in time for the iPhone X release, it just required us to complete development and testing using platform simulation tools, as the devices were not yet available. Additionally, we had a very small window of opportunity to make this happen. Our latest app release was within a few days of the iPhone X release date, which meant we needed to deliver in a compressed timeframe to ensure we were release-ready. Our team of engineers and testers were up to the challenge, motivated to enable a truly delightful experience for our users. At eBay, we are prepared for future innovations in multi-factor authentication, as we have built an extensible architecture based on the Universal Authentication Framework (or “UAF”), as defined by an industry consortium called the FIDO Alliance , of which eBay is a member. This approach allows us to more readily add future authenticators we choose to support. The authentication industry moves fast—and supporting the latest iOS and Android device capabilities is a high priority for us. Using Face ID is truly a magical experience. The depth mapping and infrared imaging technology behind it is brilliant, and it was designed to work with hats, scarves and glasses (even some sunglasses!). And it can be used inside, outside, or even in the dark. From a security and privacy perspective, Apple wants its users to know that a facial ‘image’ is captured as a mathematical representation—not an actual picture—that is encrypted and stored in a secure space on the device. So, the data never leaves the device. If you haven’t tried it, see if you can find a friend or colleague with an iPhone X and check it out. This feature is just another example of eBay leveraging new device and mobile platform technologies to improve our buying and selling experiences, making access to eBay effortless and secure. Logging into eBay with Face ID is now available to our global community of users on the iPhone X, with version 5.16 (or greater) of the eBay iOS app. BIO Dave Comer is Head of Identity Product and Engineering at eBay, where he oversees company efforts related to user onboarding, account access and management.", "date": "2017-11-20"},
{"website": "Ebay-Product", "title": "Finding That Perfect Gift on eBay Is as Easy as Asking a Friend ", "author": ["Jay Vasudevan"], "link": "https://tech.ebayinc.com/product/finding-that-perfect-gift-on-ebay-is-as-easy-as-asking-a-friend/", "abstract": "Inspired by the service in a traditional retail store, eBay is enabling a truly personalized shopping experience using Google Assistant. Searching for that perfect holiday gift or the best deal this holiday season? Finding that special gift, let alone one at a great price during the holidays is hard. But this holiday season, finding a great deal can be as easy as asking a friend — you can do it right from your couch, without lifting a finger, literally. Just tell your Google Home, “Ask eBay...” And in addition to snagging that perfect holiday deal, you can also find out what things lying around your house are worth, so you can turn them into cash and get something new right in time for that holiday shopping spree. We are reimagining the shopping experience, using artificial intelligence to make it easier and more personalized. Starting today, we are bringing the best of eBay to your home with Google Assistant, making shopping as simple as having a conversation. Using AI, we are able to create a truly personalized shopping experience inspired by the service you’d expect in a traditional retail setting. By combining eBay’s breadth of inventory and unique selection, the eBay Shopping Assistant can create a shopping experience for virtually everyone. This is the inspiration behind some of the exciting work we are doing at the intersection of artificial intelligence, cloud computing and a new commerce service that’s available wherever shoppers are. Talk to eBay on Google Home We’ve collaborated with Google to be among the first to take advantage of the multi-surface switching capability, which lets you carry a voice conversation on Google Home over to your phone, seamlessly. So when you tell Google Home that you want to buy an item on eBay, you can easily switch to your phone, take a peek at the deal recommendation to make sure everything is correct and buy with confidence. The ability to switch from a voice platform like Google Home to your phone offers a convenient personal shopping experience that you can start in your kitchen, living room or your car and continue on your phone, wherever you are, whenever you need it. We’ve also made updates to the What’s It Worth? experience on Google Assistant, so you can quickly find the value of your things to sell on eBay. AI’s Potential to Transform Shopping At eBay, we’ve developed some of the world’s most transformative and disruptive marketplace capabilities and commerce experiences. For over two decades, we’ve worked to make buying and selling effortless. As a result of these foundational ecommerce pillars, shoppers expect an experience nothing short of seamless. As we look to the future of shopping, powerful voice interfaces like Google Assistant will most certainly drive these experiences. Natural language is rich with context and meaning. When paired with the science of understanding language, deep learning and predictive modeling, we can begin to harness the power of human intent, enabling us to create a radically better and more personalized shopping experience for everyone. As you develop a relationship with the eBay Shopping Assistant by giving more information about your preferences, you will be rewarded with a more tailored experience over time. We are in the early stages of this new commerce frontier, but we are excited about the prospects of bringing the eBay shopping and selling experience closer to our customers’ everyday lives. AI has the potential to dramatically reshape online shopping with breakthrough merchandising and personalized shopping experiences. Paired with the power and reach of cloud computing, commerce can take place where and when you want it. And, when combined with eBay’s inventory and knowledge base, we see something really exciting and transformative: online shopping will be as easy as talking to a friend. Google Assistant is available on your Google Home, Home Mini devices, as well as via Google Assistant apps on Android and iOS . You can talk to eBay on Google Assistant, including Google Home, in the U.S. and Australia, just by saying “ Hey Google, ask eBay .” BIO Jay Vasudevan is a Lead Product Manager at eBay, where he and his team focus on AI-augmented shopping assistants to offer a truly ubiquitous personal shopping experience.", "date": "2017-11-28"},
{"website": "Ebay-Product", "title": "eBay Makes It Easier to Find All the Parts You Need for That Repair", "author": ["Miwa Takaki"], "link": "https://tech.ebayinc.com/product/ebay-makes-it-easier-to-find-all-the-parts-you-need-for-that-repair/", "abstract": "Hear from the product manager who built our latest feature that gives personalized guidance on finding the exact parts needed for your repair job or upgrade. So you’re a motors enthusiast and just found out your fuel injection is starting to cause you problems. You know the pressure regulator on your 2010 Honda Civic is the root cause, but did you also know you need a fuel filter and pressure regulator seal to finish the job? We are pairing machine learning with our strong product catalog to help you find exactly the parts you need to finish a repair or conduct an upgrade. It bundles listings together in a way that allows you to find everything you need to complete a project in a single listing page. When you find the regulator that you’re looking for, you’ll now also see listings for related parts to help complete your restoration, upgrade or repair project. The recommendations are personalized to YOU. This new personalized bundling experience makes it easier for you to navigate the millions of parts and accessories listings in our marketplace and lets you shop for your car in the same way as if you went into the car manufacturer or an auto repair shop. While other online auto retailers may show you related parts, there’s rarely a guarantee that those parts will fit your vehicle or even fit the same repair or project. But this new eBay experience is tailored to show only recommendations for parts that fit your vehicle. Now you can get the best of the in-store experience on eBay, as we use years of industry expertise and domain-specific data through our collaboration with WHI. Using advanced machine learning and personalization methods, we recommend the parts that fit the vehicle you are searching for and couple that with data of what others working on similar projects are searching for. With over 500 million replacement and performance part data from WHI’s catalog applied to eBay’s vast inventory, we’re able to bring the most relevant and personalized recommendations to you. So, when you start your search for that 2010 Honda Civic project, we use information that other users have provided about parts they needed in their Honda projects to suggest the most relevant parts you’ll need for your project. The personalized bundling experience is live on desktop and mobile listing pages in the U.S. BIO Miwa Takaki is a Senior Product Manager at eBay, where she focuses on Algorithmic Merchandising and Research. She lives in Manhattan and is an an avid runner. Miwa recently completed the NYC Marathon with many of her colleagues, which she’s run every year since moving to the city.", "date": "2017-12-06"},
{"website": "Ebay-Product", "title": "Is It Perfect for You? eBay Tells You ‘Why to Buy’", "author": ["Sasi Somasundarum"], "link": "https://tech.ebayinc.com/product/is-it-perfect-for-you-ebay-tells-you-why-to-buy/", "abstract": "Hear from the product manager who introduced the new feature that uses machine learning to help you shop with confidence, buying the items you really want on the eBay mobile app. When I open up the eBay app to shop for Chanel sunglasses, there are a few things that matter to me: the brand, the style and that I’m buying them from a seller who has experience. So how can I tell which sunglasses are right for me? We have added ‘Why to Buy’ signals that will quickly highlight the reasons you should buy the item you're looking at. The ‘Why to Buy’ signal intelligence uses data and machine learning to help you confidently make your purchase. Machine learning is the “brain” behind these signals and constantly optimizes along dimensions such as price, popularity and rarity. We want to simplify the decision-making process with these signals so it’s easier for you to find the things you really want. The signals range in focus from free and fast shipping to urgency, or how many items are in stock. Since we launched these signals on desktop in 2015, we’ve learned which signals give buyers more confidence to make their purchases. Now, we’re expanding these signals to eBay’s mobile apps and honing in on what’s most important to buyers. Overall, we’ve seen signals such as ‘Free in-store pickup,’ ‘Experienced seller’ and ‘Limited time remaining’ perform the best across all of our inventory. For fashion listings, signals that indicate popularity, rarity and return options matter. For electronics listings, savings, urgency, good shipping and return signals are critical. For rare inventory such as collectible items, trusted seller, savings and lower charges for customs matter, especially while buying across regions. By highlighting relevant, accurate signals, we can make it simpler for you to decide on a purchase. For example, you can see that the Chanel sunglasses above are sold by an experienced seller and that they are selling fast with the “Limited quantity available” signal – showing that they are a popular item and that, if you really want them, you should jump on the deal because they might not be available much longer. As the ‘Why to Buy’ signal intelligence expands to additional platforms, we continue to address the most challenging questions such as what is the ideal signal criteria, number of signals, order and interaction effect, and we continue to test different machine learning models. The ‘Why To Buy’ signals are currently live on desktop, iOS and Android in the U.S., U.K., Germany and Australia and will be rolling out to mWeb soon. BIO Sasi Somasundaram is Group Product Manager at eBay, where she and her team focus on providing a compelling, personalized and engaging item experience and buying flows for the 1.1 billion listings in our marketplace as well as catering to the needs of eBay’s diverse global users.", "date": "2018-01-11"},
{"website": "Ebay-Product", "title": "Peer-to-Peer Fundraising on eBay", "author": ["Scott McDowell"], "link": "https://tech.ebayinc.com/product/peer-to-peer-fundraising-on-ebay/", "abstract": "For many years, eBay has provided the ability to sell items to benefit a given charity or nonprofit organization through our eBay for Charity program. Now eBay sellers can list an item and have the funds raised credited to their favorite Event, Team, and/or Participant. Peer-to-Peer or P2P fundraising is a strategy that leverages an individual’s network of friends, family, coworkers, and peers to raise funds on their behalf. P2P is a form of crowdfunding, but differs in that it’s multi-tiered vs. the single-tier model of traditional crowdfunding. To understand the market size of P2P fundraising, nearly one-third 1 of all online donations are now made through P2P. In 2016, charitable giving in the U.S. topped $390 billion, which was up nearly 3 percent from 2015. 2 The following illustration compares the differences between traditional Crowdfunding and P2P. Click the image for a larger version. Many charities and nonprofit organizations create fundraising campaigns structured on a P2P model. One of the more popular campaign types is known as the Event/Team Fundraising campaign, in which supporters participate in a run, walk, or ride event with the goal of raising a certain dollar amount to support their cause. For many years, eBay has provided the ability to sell items to benefit a given charity or nonprofit organization through our eBay for Charity program. Now eBay sellers can list an item and have the funds raised credited to their favorite Event, Team, and/or Participant. Our new P2P offering aligns perfectly with the gamified and pseudo-competitive nature of Event Fundraising campaigns. We achieve this by creating a link between an eBay Seller and the Event, Team, and Participant they choose to support. During our research phase, we’ve identified the majority of charities and nonprofits use the following hierarchy: Event Teams Team Captain Team Participants Teams Team Captain Team Participants Team Captain Team Participants Team Participants As a Team Participant, I can define a personal goal of raising $500, which supports my team’s goal of raising $5,000, all of which rolls up to the event’s goal of $50,000. The diagram below illustrates how committed supporters become new eBay Sellers, who list items on our platform, while soft supporters become new eBay Buyers. Our P2P model creates an opportunity for organizations to raise more funds while giving supporters a new way to donate besides the traditional cash only models. In order to make all of this happen, the eBay for Charity team of engineers have developed two new web services. The first is known as the Account Affiliation Service and the second is our Transaction Reconciliation Service. The following illustration shows how these two services work in conjunction to link accounts, affiliate items for sale to a given P2P Event, and close the loop by sending all this information back to the partner organization raising funds. Click the image for a larger version of the workflow. Now that we’ve covered the high-level product concept, let’s dive into our P2P Affiliation Methods, and then we’ll explore Transaction Reconciliation. In order to understand our charitable partner’s needs, we have spoken with several stakeholders to identify a primary and secondary way of supporting an event participant. Method A - Primary Affiliation Workflow From the Charity’s Event/Team/Participant Page(s) Charities sign up for an eBay Developer Account, and we create a token to ensure the entire process of passing data between the Charity and eBay has been secured and is trusted. Charities place a Call to Action on their Event, Team, and Participant pages. Logged-in users select a Call to Action and the Charity sends the user to eBay. After logging into eBay we affiliate their account. Users then sell items to support their favorite Event, Team and/or Participant. Method B - Secondary Affiliation Workflow From eBay Charity Profile Page (CPP) In some cases, there will be donors who are not interested in creating an account on the Charity’s website, but would still like to sell items that benefit their favorite charity. In this scenario, we’re providing support by allowing the user/donor to find Events, Teams, and Participants from eBay’s website by using the Charity’s open API. Logged in eBay users select the Affiliation Call to Action from an eBay Charity Profile Page. Users then search for a Charity Event, Team, or Participant. User then selects the Event, Team, or Participant they would like to affiliate. Users then sell items to support their favorite Event, Team and/or Participant. After an affiliated supporter has sold an item, we then need to ensure the funds raised are properly reconciled with our P2P data. This allows organizations to update their online fundraising meters and financial systems. We accomplished this by writing a new Reconciliation Service that takes the key-value pair from our Affiliation Service and combines it with the rest of the transaction data for a clean response. Below is an example payload from our Reconciliation Service. Response Sample As the Product Manager for eBay’s P2P Fundraising, I’m happy to announce we recently kicked off a pilot with the American Cancer Society (ACS). As of January 2018, supporters of ACS can now list items and have the profits raised directly applied to the Event, Team, or Participant they wish to support. What’s equally exciting is that shortly after the seller has been paid, ACS will update fundraising goal meters on their website to reflect the amount of the proceeds raised through eBay sales. Below is an example of ACS’ Charity Profile Page on eBay with the Affiliation Method B. Lastly, I’d like to thank our incredibly smart and talented eBay for Charity team, without your efforts this product wouldn’t exist. And of course to our partners at the American Cancer Society, we’re looking forward providing a new way to raise funds and beat our biggest rival. 1 Donor Engagement Study; Aligning Aligning Nonprofit Strategy With Donor Preferences, Abila Inc. 2015 2 Giving USA 2017: Total Charitable Donations Rise to New High of $390.05 Billion, Giving USA. 2017", "date": "2018-02-14"}
]